"use strict"



// Задача.
// Создайте переменную str и присвойте ей значение 'abcde'.
// Обращаясь к отдельным символам этой строки выведите на экран символ 'a', символ 'b', символ 'e'.

// let str = 'abcde';
// alert(str[0]);
// alert(str[3]);
// alert(str[4]);



// Задача. Напишите скрипт, который считает количество секунд в часе.

// alert(60 * 60 * 24);



// Задача.Переделайте приведенный код так, чтобы в нем использовались операции += , -= , *= , /=, ++, --. 
// Количество строк кода при этом не должно измениться.Код для переделки:

//     var num = 1;
// num = num + 12;
// num = num - 14;
// num = num * 5;
// num = num / 7;
// num = num + 1;
// num = num - 1;
// alert(num);



// let num = 1;
// num += 12;
// num -= 14;
// num *= 5;
// num /= 7;
// num++;
// num--;
// alert(num);



// Создайте переменную num и присвойте ей значение 3. Выведите значение этой переменной на экран с помощью метода alert.

// let num = 3;
// alert(num);



// Создайте переменные a=10 и b=2. Выведите на экран их сумму, разность, произведение и частное (результат деления).

// let a = 10,
//     b = 2;

// a - b;  
// a + b;
// a * b;
// a / b;

// alert(a, b);
// // alert(a + b, a - b, a * b, a / b);



// Создайте переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. Выведите на экран значение переменной result.

// let c = 15,
//     d = 2;
// let result = c + d;
// console.log(result);
// alert(result);



// Создайте переменные a=10, b=2 и c=5. Выведите на экран их сумму.

// let a = 10,
//     b = 2,
//     c = 5;
// alert(a + b + c);



// Создайте переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c. Затем создайте переменную d, присвойте ей значение 7. 
// Сложите переменные c и d, а результат запишите в переменную result. Выведите на экран значение переменной result.

// let a = 17,
//     b = 10;
// let c = a - b;
// let d = 7;
// let result = c + d;
// console.log(result);



// Создайте переменную str и присвойте ей значение 'Привет, Мир!'. Выведите значение этой переменной на экран.

// let str = 'Привет мир!';
// console.log(str);



// Создайте переменные str1='Привет, ' и str2='Мир!'. С помощью этих переменных и операции сложения строк выведите на экран фразу 'Привет, Мир!'.



// const str = 'привет, ',
//     str2 = 'мир!';
// console.log(str + str2);



// Создайте переменную name и присвойте ей ваше имя. Выведите на экран фразу 'Привет, %Имя%!'.

// let name = 'Danial';
// console.log(`Привет, ${name}!`);



// Создайте переменную age и присвойте ей ваш возраст. Выведите на экран 'Мне %Возраст% лет!'.

// let age = 19;
// console.log(`Мне ${age} лет!`);



// Спросите имя пользователя с помощью методы prompt. Выведите с помощью alert сообщение 'Ваше имя %имя%'.

// let name = prompt('Ваше имя', '');

// alert(`Ваше имя ${name}`);



// Спросите у пользователя число. Выведите с помощью alert квадрат этого числа.

// let number = +prompt('Введите ваше число', '');

// alert(`Ваше число в квадрате ${number * number} `);



// Создайте переменную str и присвойте ей значение 'abcde'. Обращаясь к отдельным символам этой строки выведите на экран символ 'a', символ 'c', символ 'e'.

// const str = 'abcde';
// alert(str[0]);
// alert(str[2]);
// alert(str[4]);

// Создайте переменную num и присвойте ей значение '12345'. Найдите произведение (умножение) цифр этого числа.

// const num = '12345';

// num[0];
// num[1];
// num[2];
// num[3];
// num[4];

// console.log(num[0] * num[1] * num[2] * num[3] * num[4]);



// Напишите скрипт, который считает количество секунд в часе, в сутках, в месяце.

// let time = 60 * 60;
// console.log(time);



// Создайте три переменные - час, минута, секунда. С их помощью выведите текущее время в формате 'час:минута:секунда'.

// let hour = 21;
// let minute = 42;
// let second = 30;

// alert(`${hour}:${minute}:${second}`);


// Создайте переменную, присвойте ей число. Возведите это число в квадрат. Выведите его на экран.

// const number = 1233333;

// alert(number * number);



// Переделайте этот код так, чтобы в нем использовались операции +=, -=, *=, /=. Количество строк кода при этом не должно измениться.

// let num = 47;
// num = num + 7;
// num = num - 18;
// num = num * 10;
// num = num / 15;
// alert(num);

// let num = 47;
// num += 7;
// num -= 18;
// num *= 10;
// num /= 15;
// alert(num);



// Переделайте этот код так, чтобы в нем использовались операции ++ и --. Количество строк кода при этом не должно измениться.

// var num = 10;
// num = num + 1;
// num = num + 1;
// num = num - 1;
// alert(num);

// let num = 10;
// num++;
// num++;
// num--;
// alert(num);


// let arr = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс']; //// вызывем массив со знаечением дней недели
// let arr = ['пн', 256, 'ср', 34, 38, 'сб', 95];


// alert(arr[2]); // Выводим отдельный элемент массива



// ассоциативные массивы | ключ: значение.

// let obj = { 1: 'пн', 2: 'вт', 3: 'ср', 4: 'чт', 5: 'пт', 6: 'сб', 7: 'вс' };
// alert(obj[1]); //выведет 'пн'

// let obj = { 'Коля': 200, 'Вася': 300, 'Петя': 400 };

// let obj = { key1: 200, key2: 300, key2: 400 };
// alert(obj.key1); //выведет 200



/// Здесь показано - заполнение массива, 
/// может осуществлятся не только на этопе его создания!

// let arr = [];
// arr[0] = 1;
// arr[1] = 2;
// arr[2] = 3;
// console.log(arr);



/// Объекты так же

// let obj = {};
// obj['Nikolay'] = 100;
// obj['Elena'] = 200;
// obj['Katrin'] = 300;
// console.log(obj);



/// Многомерный массив

// Давайте сделаем массив студентов students, который будет 
// содержать два подмассива: студенты мужского пола и женского:

// let students = {
//     'boys': ['Nikolay', 'Eugene', 'Alex'],
//     'girls': ['Elena', 'Sasha', 'Katrin'],
// };

// console.log(students);



/// Практика массивов и объектов

// Дан массив с элементами 'Привет, ', 'мир' и '!'. 
// Необходимо вывести на экран фразу 'Привет, мир!'.

// let arr = ['Привет, ', 'мир', '!'];
// console.log(arr[0], arr[1], arr[2]);



// Решим немного другую задачу: дан массив с элементами 'Привет, ', 'мир' и '!'. 
// Необходимо записать в переменную text фразу 'Привет, мир!', 
// а затем вывести на экран содержимое этой переменной.

// let arr = ['Привет, ', 'мир', '!'];

// let text = arr[0] + arr[1] + arr[2];

// console.log(text);



// Дан массив ['Привет, ', 'мир', '!']. 
// Необходимо записать в нулевой элемент этого 
// массива слово 'Пока, ' (то есть вместо слова 'Привет, ' будет 'Пока, ').


// let arr = ['Привет, ', 'мир', '!'];
// arr[0] = 'Пока';
// console.log(arr);



// Создайте ассоциативный массив (объект) заработных плат obj. 
// Выведите на экран зарплату Пети и Коли.

// let obj = { 'Petya': '2000', 'Nikolay': '2200', 'Nikita': '3000' }
// console.log(obj['Petya']);
// console.log(obj['Nikolay']);



// Создайте массив arr с элементами 1, 2, 3, 4, 5 двумя различными способами.

// let arr1 = [1, 2, 3, 4, 5];
// console.log(arr1);

// let arr = [];
// arr[0] = 1;
// arr[1] = 2;
// arr[2] = 3;
// arr[3] = 4;
// arr[4] = 5;
// console.log(arr);



// Дан многомерный массив arr:

// let arr = {
//     'ru': ['голубой', 'красный', 'зеленый'],
//     'en': ['blue', 'red', 'green'],
// };

// Выведите с его помощью слово 'голубой'.

// console.log(arr.ru[0]); // мое решение
// console.log(arr['ru'][0]); // решение автора



// Создайте массив arr = ['a', 'b', 'c']. Выведите его на экран с помощью функции alert.

// let arr = ['a', 'b', 'c'];
// console.log(arr);



// С помощью массива arr из предыдущего номера выведите на экран 
// содержимое первого, второго и третьего элементов.

// let arr = ['a', 'b', 'c'];

// console.log(arr[0]);
// console.log(arr[1]);
// console.log(arr[2]);



// Создайте массив arr = ['a', 'b', 'c', 'd'] и с его помощью выведите на экран строку 'a+b, c+d'.

// let arr = ['a', 'b', 'c', 'd'];
// console.log(arr[0] + '+' + arr[1] + ',', arr[2] + '+' + arr[3]);




// Создайте массив arr с элементами 2, 5, 3, 9. Умножьте первый элемент массива на второй, 
// а третий элемент на четвертый. Результаты сложите, присвойте переменной result. Выведите на экран значение этой переменной.



// let arr = [2, 5, 3, 9];

// let i = arr[0] * arr[1];
// let b = arr[2] * arr[3];

// let result = i + b;
// console.log(result);



// Создайте объект obj. Выведите на экран элемент с ключом 'c' двумя способами: через квадратные скобки и как свойство объекта:

// let obj = { a: 1, b: 2, c: 3 };

// console.log(obj.c);
// console.log(obj['c']);



// Создайте массив заработных плат obj. Выведите на экран зарплату Пети и Коли.

// let obj = { Коля: '1000', Вася: '500', Петя: '200' };

// console.log(obj['Петя']);
// console.log(obj['Коля']);



// Создайте объект с днями недели. Ключами в нем должны служить номера дней от начала недели (понедельник - первый и т.д.). 
// Выведите на экран текущий день недели.


// let obj = {
//     'Понедельник': '1',
//     'Вторник': '2',
//     'Среда': '3',
//     'Четверг': '4',
//     'Пятница': '5',
//     'Суббота': '6',
//     'Воскресенье': '7'

// };



// console.log(obj['Четверг']);


// Пусть теперь номер дня недели хранится в переменной day, например там лежит число 3.
// Выведите день недели, соответствующий значению переменной day.


// let obj = {
//     '1': 'Понедельник',
//     '2': 'Вторник',
//     '3': 'Среда',
//     '4': 'Четверг',
//     '5': 'Пятница',
//     '6': 'Суббота',
//     '7': 'Воскресенье',

// };

// let day = '3';

// console.log(obj[day]);



// console.log(obj['Четверг']);



// Дан массив [ [1, 2, 3], [4, 5, 6], [7,8,9] ]. Выведите на экран цифру 4 из этого массива.

// let numbers = [
//     [1, 2, 3],
//     [4, 5, 6],
//     [7, 8, 9]
// ];

// console.log(numbers[1][0]);


// Дан объект {js:['jQuery', 'Angular'], php: 'hello', css: 'world'}. Выведите с его помощью слово 'jQuery'.

// let string = { js: ['jQuery', 'Angular'], php: 'hello', css: 'world' };

// console.log(string['js'][0]);


// Создайте двухмерный массив. Первые два ключа - это 'ru' и 'en'. Пусть первый ключ содержит элемент, 
// являющийся массивом названий дней недели по-русски, а второй - по-английски. Выведите с помощью этого 
// массива понедельник по-русски и среду по английски (пусть понедельник - это нулевой день).


// let weeks = {
//     'ru': ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье'],
//     'en': ['Mondey', 'Tuesday', 'Wednesdey', 'Thursday', 'Friday', 'Saturday', 'Sunday']

// };

// console.log(weeks['ru'][0], weeks['en'][2]);


// Пусть теперь в переменной lang хранится язык (она принимает одно из значений или 'ru', или 'en' - либо то, либо то), а в переменной day - номер дня. 
// Выведите словом день недели, соответствующий переменным lang и day. То есть: если, к примеру, lang = 'ru' и day = 3 - то выведем 'среда'.

// let weeks = {
//     'ru': ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье'],
//     'en': ['Mondey', 'Tuesday', 'Wednesdey', 'Thursday', 'Friday', 'Saturday', 'Sunday']

// };

// const lang = 'ru';
// const day = 2;

// // console.log(weeks.lang.day);
// console.log(weeks[lang][day]);



// Конструкция if-else

// if (логическое выражение) {
// 	Этот код выполниться,
// 	если логическое выражение верно (то есть равно true)
// } else {
// 	Этот код выполнится,
// 	если логическое выражение неверно (то есть равно false)
// }

// let a = 1;

// if (a > 2) {
//     console.log('True');
// } else {
//     console.log('False');
// };


// Сокращенный синтаксис

// let a = 3;


// if (a == 0) { alert('Верно!'); } else { alert('Неверно!'); } /// полный вариант

// if (a == 0) alert('Верно!');
// else { alert('Неверно!'); } /// убераем скобки после if

// if (a == 0) { alert('Верно!'); } else alert('Неверно!'); /// убераем скобки после else

// if (a == 0) alert('Верно!');
// else alert('Неверно!'); /// убираем после if and else



// Равенство по значению и типу

// let a = 0;

// if (a == 0) {
//     console.log('True');
// } else {
//     'False'
// };

// if (a == 0) console.log('True');
// else console.log('False');

// let a = 0;

// if (a = 1) {
//     console.log('True');
// } else { console.log('False'); };


// == сравнивает только по значению 
// ==== сравнивает не только по значению, но и по типу

// let a = '0';

// if (a == 0) { console.log('True'); } else { console.log('False'); }

// if (a === 0) { console.log('True'); } else { console.log('False'); }


// Не равно

// != и !==. Первый игнорирует различие в типах, а второй - нет.


// let a = '0';

// if (a != 0) { console.log('Верно'); } else { console.log('False') };



// let a = '0';

// if (a !== 0) { console.log('Верно'); } else { console.log('False') };



// Несколько условий сразу

// && (логическое И) и || (логическое ИЛИ).


// ользователь вводит месяц своего рождения и вам нужно проверить,
// что введенное число больше или равно 1 и меньше либо равно 12 (так как в году 12 месяцев).

// let a = 3;
// let b = -3;

// if (a > 0 && b < 0) {
//     console.log('True');
// } else { console.log('False') };


// let a = 3;

// if (a => 1 && a <= 12) { console.log('Верно'); } else { console.log('False'); };

// let a = -3;
// let b = -3;

// if (a > 0 || b < 0) console.log('True');
// else console.log('False');


// Работа с логическими переменными

// let a = true;

// if (a == true) {
//     console.log('True');
// } else { console.log('False'); };


// Прием такой: конструкцию a == true можно заменить на более простую: вместо if (a == true) написать if (a) и она будет работать аналогично.

// let a = true;

// if (a) console.log('True');
// else console.log('False');


// let a = true;

// if (!a) console.log('True'); /// не true !a
// else console.log('False');


// //Данное выражение всегда будет выводить 'Верно'
// if (true) alert('Верно!'); else alert('Неверно!');

// //Данное выражение всегда будет выводить 'Неверно'
// if (false) alert('Верно!'); else alert('Неверно!');

// //Данное выражение всегда будет выводить 'Неверно'
// if (!true) alert('Верно!'); else alert('Неверно!');

// //Данное выражение всегда будет выводить 'Верно'
// if (!false) alert('Верно!'); else alert('Неверно!');


// Вложенные if

// Предположим, нам необходимо спросить у JavaScript такую вещь: если переменная a не определена, то вывести 
// 'Введите a', если определена, то проверить - больше нуля a или нет. Если больше нуля - то вывести 'Больше нуля!', если меньше - вывести 'Меньше нуля'.

// let a = ''; // 3

// if (a === undefined) {
//     console.log('Введите a');
// } else {
//     if (a > 0) { console.log('Больше нуля'); } else { console.log('Меньше нуля'); }
// }

// Конструкция else if

// Недостатком конструкции предыдущего примера является большое количество фигурных скобок.

// Чтобы избавиться от них, можно пользоваться специальной конструкцией else if, которая представляет собой одновременно и else, и начало вложенного if:


// let a = 3;

// if (a == undefined) {
//     console.log('Insert a');
// } else if (a > 0) {
//     console.log('Больше нуля')
// } else { console.log('Меньше нуля'); };

// Несколько if

// Пусть у нас есть такая задача: сайт поддерживает 3 языка - русский, английский, немецкий.
// Переменная lang может принимать 3 значения - 'ru', 'en' и 'de'. 
// В зависимости от значения переменной lang следует вывести фразу на одном из языков.

// Решение: можно было бы воспользоваться вложенными ифами или else if. Выглядело бы это примерно так:


//Решение задачи через else if – не самое удачное:
// if (lang == 'ru') { //фраза на русском
// 	console.log('Русский текст');
// } else if (lang == 'en') { //фраза на английском
// 	console.log('Английский текст');
// } else if (lang == 'de') { //фраза на немецком
// 	console.log('Немецкий текст');


// const lang = 'ru';

// if (lang == 'ru') { //фраза на русском
//     console.log('Русский текст');
// }
// if (lang == 'en') { //фраза на английском
//     console.log('Английский текст');
// }
// if (lang == 'de') { //фраза на немецком
//     console.log('Немецкий текст');
// }



// Конструкция switch-case

// switch (переменная) {
// 	case 'значение1':
//  		здесь код, который выполнится в случае, если переменная имеет значение1;
// 	break;
// 	case 'значение2':
// 		здесь код, который выполнится в случае, если переменная имеет значение2;
// 	break;
// 	case 'значение3':
// 		здесь код, который выполнится в случае, если переменная имеет значение3;
// 	break;
// 	default:
// 		этот код выполнится в случае, если переменная не совпала ни с одним значением;
// 	break;
// }


// let lang = '123';

// switch (lang) {
//     case 'ru':
//         console.log('Text on russian');
//         break;
//     case 'en':
//         console.log('Text on english');
//         break;
//     case 'kz':
//         console.log('Text on kz');
//         break;
//     default:
//         console.log('No one language');
//         break;
// }


// Задача. Если переменная a равна 10, то выведите 'Верно', иначе выведите 'Неверно'.

// let a = '10';

// if (a == 10) {
//     console.log('Верно');
// } else { console.log('Неверно') };


// В переменной min лежит число от 0 до 59. Определите в какую четверть часа попадает это число (в первую, вторую, третью или четвертую).

// const min = 12;

// if (min >= 0 && min <= 14) {
//     console.log('1');
// }
// if (min >= 15 && min <= 30) {
//     console.log('2');
// }
// if (min >= 31 && min <= 45) {
//     console.log('3');
// }
// if (min >= 46 && min <= 59) {
//     console.log('4');
// }

// Переменная lang может принимать 2 значения: 'ru' 'en'. Если она имеет значение 'ru', то в переменную arr запишем массив дней недели на русском языке, 
// а если имеет значение 'en' – то на английском. Решите задачу через 2 if, через switch-case и через многомерный массив без ифов и switch.


/// 1
// let lang = 'ru';

// if (lang == 'ru') {
//     let arr = ['Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб', 'Вс'];
//     console.log(arr);
// }
// if (lang == 'en') {
//     let arr = ['M', 'T', 'W', 'T', 'F', 'S', 'S'];
//     console.log(arr);
// }


//2
// let lang = 'ru';

// switch (lang) {
//     case 'ru':
//         {
//             let arr = ['Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб', 'Вс'];
//             console.log(arr);
//             break;
//         }
//     case 'en':
//         {
//             let arr = ['M', 'T', 'W', 'T', 'F', 'S', 'S'];
//         }
// }


//3
// let lang = 'ru';

// let arr = {
//     'ru': ['Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб', 'Вс'],
//     'en': ['M', 'T', 'W', 'T', 'F', 'S', 'S']
// }

// console.log(arr[lang]);


// Если переменная a равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.

// let a = -3;

// if (a == 0) {
//     console.log('True');
// } else { console.log('False'); }


// Если переменная a больше нуля, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.


// let a = -3;

// if (a > 0) {
//     console.log('True');
// } else {
//     console.log('False');
// }



// Если переменная a меньше нуля, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.

// let a = 1;

// if (a < 0) {
//     console.log('True');
// } else {
//     console.log('False');
// }

// Если переменная a больше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.

// let a = 1;

// if (a >= 0) {
//     console.log('True');
// } else {
//     console.log('False');
// }

// Если переменная a меньше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.

// let a = 1;

// if (a <= 0) {
//     console.log('True');
// } else {
//     console.log('False');
// }

// Если переменная a не равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.


// let a = 1;

// if (a != 0) {
//     console.log('True');
// } else {
//     console.log('False');
// }


// Если переменная a равна 'test', то выведите 'Верно', иначе выведите 'Неверно'.Проверьте работу скрипта при a, равном 'test', 'тест', 3.

// let a = 'test';

// if (a == 'test') {
//     console.log('True');
// } else {
//     console.log('False');
// }


// Если переменная a равна '1' и по значению и по типу, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном '1', 1, 3.

// let a = '1';

// if (a === '1') {
//     console.log('True');
// } else {
//     console.log('False');
// }


// Если переменная test равна true, то выведите 'Верно', иначе выведите 'Неверно'. 
// Проверьте работу скрипта при test, равном true, false. Напишите два варианта скрипта - с короткой записью и с длинной.


// let test = true;

// if (test == true) { console.log('True'); } else { console.log('False'); }

// let test = true;

// if (test) console.log('true');
// else console.log('false');


// Если переменная test не равна true, то выведите 'Верно', иначе выведите 'Неверно'. 
// Проверьте работу скрипта при test, равном true, false. Напишите два варианта скрипта - с короткой записью и с длинной.

// let test = false;

// if (test != true) {
//     console.log('true');
// } else { console.log('false'); }

// let test = false;

// if (test != true) console.log('true');
// else console.log('false');


// Если переменная a больше нуля и меньше 5-ти, то выведите 'Верно',
// иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 5, 0, -3, 2.


// let a = 2;

// if (a > 0 && a < 5) {
//     console.log('True');
// } else {
//     console.log('False');
// }


// Если переменная a равна нулю или равна двум, то прибавьте к ней 7, иначе поделите ее на 10. 
// Выведите новое значение переменной на экран. Проверьте работу скрипта при a, равном 5, 0, -3, 2.

// let a = 1;

// if (a == 0 || a == 2) {
//     a = a + 7;
// } else {
//     a = a / 10;

// }

// console.log(a);


// Если переменная a равна или меньше 1, а переменная b больше или равна 3, то выведите сумму этих переменных, 
// иначе выведите их разность (результат вычитания). Проверьте работу скрипта при a и b, равном 1 и 3, 0 и 6, 3 и 5.


// const a = 1;
// const b = 3;

// if (a <= 1 && b >= 3) {
//     console.log(a + b);
// } else {
//     console.log(a - b);
// }


// Если переменная a больше 2-х и меньше 11-ти, или переменная b больше или равна 6-ти и меньше 14-ти, то выведите 'Верно', в противном случае выведите 'Неверно'.

// let a = 4;
// let b = 6;

// if (a > 2 && a < 11 && b >= 6 && b < 14) {
//     console.log('True');

// } else {
//     console.log('False');
// }


// Переменная num может принимать 4 значения: 1, 2, 3 или 4. Если она имеет значение '1', 
// то в переменную result запишем 'зима', если имеет значение '2' – 'весна' и так далее. Решите задачу через switch-case.


// let years = '1';

// switch (years) {
//     case '1':
//         {
//             let arr = 'First';
//             console.log(arr);
//         };
//         break;
//     case '2':
//         {
//             let arr = 'Second';
//             console.log(arr);
//         }
//         break;
//     case '3':
//         {
//             let arr = 'Third';
//             console.log(arr);
//         }
//         break;
//     case '4':
//         {
//             let arr = 'Fourth';
//             console.log(arr);
//         }


//         break;
// }


// В переменной day лежит какое-то число из интервала от 1 до 31. Определите в какую декаду 
// месяца попадает это число (в первую, вторую или третью).

// let day = 23;

// if (day >= 1 && day <= 10) {
//     console.log('True');
// }
// if (day >= 11 && day <= 20) {
//     console.log('True 2');
// }
// if (day >= 21 && day <= 31) {
//     console.log('True 3');
// }

// В переменной month лежит какое-то число из интервала от 1 до 12. Определите в какую пору года попадает этот месяц (зима, лето, весна, осень).

// let month = 2;

// if (month == 1) {
//     console.log('1');
// }
// if (month == 2) {
//     console.log('2');
// }
// if (month == 3) {
//     console.log('3');
// }
// if (month == 4) {
//     console.log('4');
// }
// if (month == 5) {
//     console.log('5');
// }
// if (month == 6) {
//     console.log('6');
// }
// if (month == 7) {
//     console.log('7');
// }
// if (month == 8) {
//     console.log('8');
// }
// if (month == 9) {
//     console.log('9');
// }
// if (month == 10) {
//     console.log('10');
// }
// if (month == 11) {
//     console.log('11');
// }
// if (month == 12) {
//     console.log('12');
// }


// Дана строка, состоящая из символов, например, 'abcde'. 
// Проверьте, что первым символом этой строки является буква 'a'. Если это так - выведите 'да', в противном случае выведите 'нет'.

// let string = 'bbcde';

// if (string[0] == 'a') {
//     console.log('yes');
// } else {
//     console.log('no');
// }

// Дана строка с цифрами, например, '12345'. 
// Проверьте, что первым символом этой строки является цифра 1, 2 или 3. Если это так - выведите 'да', в противном случае выведите 'нет'.

// let string = '32145';

// if (string[0] == '1' && string[1] == '2' && string[2] == '3') {
//     console.log('yes');
// } else {
//     console.log('no');
// }


// Дана строка из 3-х цифр. Найдите сумму этих цифр. То есть сложите как числа первый символ строки, второй и третий.

// let numbers = '123';

// numbers[0];
// numbers[1];
// numbers[2];

// console.log(Number(numbers[0]) + Number(numbers[1]) + Number(numbers[2]));


// Дана строка из 6 - ти цифр.Проверьте, что сумма первых трех цифр равняется сумме вторых трех цифр.
// Если это так - выведите 'да', в противном случае выведите 'нет'.

// let numbers = '123123';


// let firstN = Number(numbers[0]) + Number(numbers[1]) + Number(numbers[2]);

// let secondN = Number(numbers[3]) + Number(numbers[4]) + Number(numbers[5]);

// if (firstN == secondN) {
//     console.log('yes');
// } else {
//     console.log('no');
// }





/// цикл for and while



// while ( пока выражение истинно ) {
// 	выполняем этот код циклически; 
// 	в начале каждого цикла проверяем выражение в круглых скобках
// }
// /*
// 	Цикл закончится, когда выражение перестанет быть истинным.
// 	Если оно было ложным изначально - то он не выполнится ни разу!
// */

// let i = 0;
// while (i < 5) {
//     i++;
//     console.log(i);
// }


// for ( начальные команды; условие окончания цикла; команды после прохода цикла ) {
// 	тело цикла
// }


// for (let i = 0; i < 10; i++) {
//     console.log(i);
// }

// for (let i = 0; i < 10; i++);
// console.log(i);

// for (var i = 0; i < 10; i++); //<--- точка с запятой есть
// console.log(i);

// несколько циклов

// for (var i = 0, j = 2; i < 10; i++, j++, i = i + j) {
//     console.log(i);
// }

// let arr = [1, 2, 3, 4, 5];

// for (var i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }


// Цикл for-in

// let obj = { Kola: 300, Vasya: 200, Petya: 333 };

// for (key in obj) {
//     console.log(obj[key]);
// }

// let obj = { Kola: 300, Vasya: 200, Petya: 333 };

// for (key in obj) {
//     console.log(key);
// }


// Инструкция break

// let arr = [1, 2, 3, 4, 5];

// for (i = 0; i < arr.length; i++) {
//     if (arr[i] === 3) {
//         break;
//     } else {
//         console.log(i);
//     }
// }


// Задача. Выведите столбец чисел от 1 до 50.

// for (var i = 0; i <= 50; i++) {
//     console.log(i);
// }


// Дан массив с элементами [1, 2, 3, 4, 5]. С помощью цикла for выведите все эти элементы на экран.

// let arr = [1, 2, 3, 4, 5];

// for (var i = 0; i <= arr.length; i++) {
//     console.log(i);
// }


// Задача. Дан массив с элементами [2, 3, 4, 5]. С помощью цикла for найдите произведение элементов этого массива.

// let result = 1;
// let arr = [2, 3, 4, 5];

// for (var i = 0; i < arr.length; i++) {
//     result *= arr[i];
// }

// console.log(result);


// Задача. Дан объект obj с ключами 'Минск', 'Москва', 'Киев' с элементами 'Беларусь', 'Россия', 'Украина'.
// С помощью цикла for-in выведите на экран строки такого формата: 'Минск - это Беларусь.'.

// let obj = { 'Минск': 'Беларусь', 'Москва': 'Россия', 'Киев': 'Киев' };

// for (key in obj) {
//     console.log(obj[key]);
// }

// for (key in obj) {
//     console.log(key + ' - это ' + obj[key] + '.');
// }

// Выведите столбец чисел от 1 до 100.


// for (let i = 0; i <= 100; i++) {
//     console.log(i);
// }

// let i = 0;

// while (i < 100) {
//     i++;
//     console.log(i);
// }


// Выведите столбец чисел от 11 до 33.

// for (let i = 11; i <= 33; i++) {
//     console.log(i);
// }

// let i = 11;
// while (i < 33) {
//     i++;
//     console.log(i);
// }


// Выведите столбец четных чисел в промежутке от 0 до 100.

// for (let i = 0; i <= 100; i++) {
//     if (i % 2 == 0) {
//         console.log(i);
//     }
// }

// С помощью цикла найдите сумму чисел от 1 до 100.

// let sum = 0;

// for (let i = 0; i <= 100; i++) {
//     sum += i;


// }

// console.log(sum);


// С помощью цикла найдите сумму четных чисел от 1 до 100.

// let sum = 0;


// for (let i = 0; i <= 100; i++) {
//     if (i % 2 == 0) {
//         sum += i;

//     }
// }
// console.log(sum);

// Дан массив с элементами [1, 2, 3, 4, 5]. С помощью цикла for выведите все эти элементы на экран.

// let arr = [1, 2, 3, 4, 5];

// for (let i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }

// Дан массив с элементами [1, 2, 3, 4, 5]. С помощью цикла for найдите сумму элементов этого массива. Запишите ее в переменную result.

// let arr = [1, 2, 3, 4, 5];
// let result = 0;

// for (let i = 0; i < arr.length; i++) {
//     result += arr[i];
// }
// console.log(result);

// Дан объект obj. С помощью цикла for-in выведите на экран ключи и элементы этого объекта.

// let obj = { green: 'зеленый', red: 'красный', blue: 'голубой' }

// for (key in obj) {
//     // console.log(key + ' ' + obj[key]);
//     console.log(key);
//     console.log(obj[key]);

// }


// dан объект obj с ключами Коля, Вася, Петя с элементами '200', '300', '400'. 
// С помощью цикла for-in выведите на экран строки такого формата: 'Коля - зарплата 200 долларов.'.

// let obj = { Kola: '200', Vasya: 300, Petya: '400' };

// for (key in obj) {
//     console.log(key + ' - зарплата' + ' ' + obj[key] + ' ' + 'долларов.');
// }


// Дан массив с элементами 2, 5, 9, 15, 0, 4. С помощью цикла for и оператора if выведите на экран столбец тех элементов массива, которые больше 3-х, но меньше 10.

// let arr = [2, 5, 9, 15, 0, 4];


// for (key in arr) {
//     if (arr[key] > 3 && arr[key] < 10) {

//         console.log(arr[key]);
//     }
// }


// Дан массив с числами. Числа могут быть положительными и отрицательными. Найдите сумму положительных элементов массива.

// let arr = [1, 23, 4, -4, -3, -2, 23, 32];
// let result = 0;

// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] > 0) {
//         result += arr[i];
//     }
// }

// console.log(result);


// Дан массив с элементами 1, 2, 5, 9, 4, 13, 4, 10. С помощью цикла for и оператора if проверьте есть ли в массиве элемент со значением, равным 4. 
// Если есть - выведите на экран 'Есть!' и выйдите из цикла. Если нет - ничего делать не надо.

// let arr = [1, 2, 5, 9, 3, 13, 2, 4];

// for (i = 0; i < arr.length; i++) {
//     if (arr[i] === 4) {
//         console.log('True');
//         break;
//     } else {
//         console.log('False');
//     }
// }


// Дан массив числами, например: [10, 20, 30, 50, 235, 3000]. Выведите на экран только те числа из массива, которые начинаются на цифру 1, 2 или 5.

// Задача не решена !!!
// let num = [10, 20, 30, 50, 235, 3000];

// for (let i = 0; i < num.length; i++) {
//     if (num[i] === '1' && num[i] === '2' && num[i] === '5') {
//         console.log(num[i]);
//         break;
//     }
// }



// Дан массив с элементами 1, 2, 3, 4, 5, 6, 7, 8, 9. С помощью цикла for создайте строку '-1-2-3-4-5-6-7-8-9-'.

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];

// let str = arr.join('-');

// console.log(str);

// Найдите остаток от деления следующих переменных:

// let a = 13;
// let b = 5;

// console.log(a % b);


// console.log(2 * 2 ** 3);


// Шаблонные строки в JavaScript


// let str = `abc`;
// alert(str); // выведет 'abc'

// let someText = 'sosojambo';

// let textFin = `Pososi moy ${someText}`;

// console.log(textFin);

// let a = '123';
// console.log(Number(a));

// let a = +'123';

// console.log(a);

// parse Int, FLOAT

// let a = '123';
// let b = '321';

// console.log(parseInt(a) + parseInt(b));

// let c = '12.3px';
// let g = '23.2px';

// console.log(parseFloat(c) + parseFloat(g));


// 123 => String => '123'

// let a = 123;

// console.log(String(a));

// let a = 12;
// let b = 31;

// console.log(String(a) + String(b));

// let a = 1234;

// console.log(a.length); undefined

// let a = 1234;
// let b = 2311;

// let strA = String(a).length;
// let strB = String(b).length;

// console.log(strA + strB);

// Преобразование логического типа в JavaScript

// alert(String(true));  // выведет 'true'
// alert(String(false)); // выведет 'false'

// console.log(Number(true)); // 1
// console.log(Number(false)); // 0

// console.log(true + 1); // 2

// Преобразование к логическому типу в JavaScript

// console.log(Boolean(0));          // false
// console.log(Boolean(-0));         // false
// console.log(Boolean(+0));         // false
// console.log(Boolean(null));       // false
// console.log(Boolean(false));      // false
// console.log(Boolean(NaN));        // false
// console.log(Boolean(undefined));  // false
// console.log(Boolean(''));         // false

// console.log(Boolean(-1));          // true
// console.log(Boolean(Infinity));    // true
// console.log(Boolean(-Infinity));   // true

// console.log(Boolean('0'));         // true
// console.log(Boolean('false'));     // true
// console.log(Boolean('NaN'));       // true
// console.log(Boolean('null'));      // true
// console.log(Boolean('undefined')); // true


// let test = Boolean(1 / 0);
// console.log(test);

// Последний символ строки в JavaScript

// let str = 'asdfgh';
// let last = str.length - 1;

// console.log(str[last]);


// let str = 'qweqwedsd';

// let sLast = str.length - 3;

// console.log(str[sLast]);


// Строки с цифрами в JavaScript


// let test = '12345';

// console.log(test[0] + test[1]);

// let test = '12345';

// console.log(Number);

// let num = '1234';

// console.log(Number(num[0]) + Number(num[1]) + Number(num[2]) + Number(num[3]));
// console.log(num[0] * num[1] * num[2] * num[3]);
// console.log(num[3]+num[2]+num[1]+num[0]);


// Сокращенные операции в JavaScript

// let num = 1;
// num = num + 2;

// console.log(num); // 3

// Сокращенные операции

// let num = 1;
// num += 2; // -=, *=, /=

// console.log(num);

// Переделайте этот код так, чтобы в нем использовались описанные сокращенные операции:

// let num = 47;
// num += 7;
// num -= 18;
// num *= 10;
// num /= 15;
// console.log(num);


// Операции инкремента и декремента в JavaScript

// let num = 0;
// num = num + 1; // прибавляем к переменной num число 1
// alert(num);    // выведет 1

// let num = 0;
// num++;
// num--;

// console.log(num);
// Переделайте этот код так, чтобы в нем операции инкремента и декремента:

// let num = 10;
// num = num + 1;
// num = num + 1;
// num = num - 1;
// alert(num);

// let num = 10;
// num++;
// num++;
// num--;
// console.log(num);

// Неточные вычисления в JavaScript

// let a = 0.1 + 0.2;
// console.log(a);

// let a = 0.1 + 0.2;
// console.log(a.toFixed(1)); // Метод toFixed выдает в виде строки => +a.toFixed(1)

// // Функция prompt в JavaScript
// let name = prompt('Ваше имя?');

// alert('Ваше имя: ' + name);

// let num1 = prompt('Введите первое число');
// let num2 = prompt('Введите второе число');

// // alert(num1 + num2); // сложит числа как строки

// alert(Number(num1) + Number(num2));


// С помощью функции prompt спросите у пользователя сторону квадрата. Выведите на экран площадь введенного квадрата.

// let num = prompt('Введите сторону квадрата:');

// alert(Number(num) * Number(num));

// // С помощью двух функций prompt спросите у пользователя стороны прямоугольника. Выведите на экран периметр введенного прямоугольника.

// let firstP = prompt('Введите первую сторону:');
// let secondP = prompt('Введите вторую сторону:');

// alert(2 * (Number(firstP) + Number(secondP)));



// let num1 = 1;
// let num2 = 2;
// console.log('сумма: ' + Number(num1 + num2));

// let a = 1;
// let b = 2;
// let c = 0;
// console.log(a + b + c);

// let num = '123';
// let sum = Number(num[0]) + Number(num[1]) + Number(num[2]);
// console.log(sum);

// let num = 123;
// let sum = String(num);

// console.log(sum[0]);

// let a = 0;
// console.log(++a);

// let num = 123;

// console.log(String(num).length);

// let a = 24 * 60 * 60;
// console.log(a);

// let num = 123;
// let str = String(num);
// console.log(str.length);

// let num = 123;
// let str = String(num);
// console.log(str[2]);



// let num = 123;
// let str = String(num);
// console.log(str.length);


// let num = 123;
// let str = String(num);
// console.log(str[2]);


// let a = '123';
// let b = '456';
// let s = Number(a) + Number(b);

// console.log(s);

// let aaa = 1;
// let bbb = 2;
// let ccc = 3;

// console.log(aaa + bbb + ccc);


// const second = 60;
// const minute = 60;
// const hour = 24;
// const day = hour;

// // 1
// console.log(second * minute * hour);

// // 2
// // Найдите количество секунд в 30 сутках.

// let days = 30;
// console.log(second * minute * hour * day)

// // 3
// // Найдите количество секунд в году.

// let yearsDays = 365;

// console.log(second * minute * hour * yearsDays);

// // 4
// // Найдите количество минут в сутках.

// console.log(day * minute);

// // 5
// // Найдите количество минут в году

// console.log(yearsDays * hour * minute);



// const byte = 8;
// const kByte = 1024;
// const mByte = 1024;
// const gByte = 1024;
// const tByte = 1024;

// //1 
// // Найдите количество байт в мегабайте.

// console.log(mByte * kByte * byte);

// // 2
// // Найдите количество байт в гигабайте.

// console.log(gByte * mByte * kByte * byte);

// // 3
// // Найдите количество байт в 10 гигабайтах.

// console.log((10 * gByte) * mByte * kByte * byte);

// // 4
// // Найдите количество байт в терабайте.

// console.log(tByte * gByte * mByte * kByte * byte);

// // 5
// // Найдите количество килобайт в терабайте.

// console.log(tByte * gByte * mByte * kByte);



//1 
// Пусть дана переменная r с радиусом круга. По соответствующей формуле
//  найдите площадь круга и запишите ее в переменную s. Выведите содержимое этой переменной на экран.


// const p = 3.14;
// let r = 10;

// let s = p * (r * r);

// console.log(s);
// alert(s);

//2
// Пусть дана переменная a со стороной квадрата. 
// Найдите площадь квадрата и запишите ее в переменную s. Выведите содержимое этой переменной на экран.

// let a = 10;

// let s = a * a;

// console.log(s);
// alert(s);

//3 
// // Пусть даны переменные a и b со сторонами прямоугольника. 
// Найдите площадь прямоугольника и запишите ее в переменную s. Выведите содержимое этой переменной на экран.

// let a = 12;
// let b = 13;
// let s = a * b;

// console.log(s);

// // 4 
// Пусть даны переменные a и b со сторонами прямоугольника.
// Найдите периметр прямоугольника и запишите его в переменную p. Выведите содержимое этой переменной на экран.

// let a = 13;
// let b = 32;
// let p = 2 * (a + b);

// console.log(p);

//5 
// Пусть дана переменная tc с температурой в градусах Цельсия. 
// По соответствующей формуле выполните перевод этой температуры в градусы Фаренгейта.

// let tc = 50;
// let tf = (tc * 1.8) + 32;

// console.log(tf);

// //6
// Пусть дана переменная tf с температурой в градусах Фаренгейта. 
// По соответствующей формуле выполните перевод этой температуры в градусы Цельсия.

// let tf = 122;
// let cf = (5 / 9) * (tf - 32)

// console.log(cf);

/// Массивы

// let arr = ['a', 'b', 'c'];

// let arr = [1,2,3];

// let arr = [1, 2, 'a', 'b', null, true, false]

// Создайте массив с числами. Выведите его на экран с помощью функции alert, 
// а также выведите его в консоль с помощью console.log.

// let arr = [1, 2, 3, 4, 5];
// // alert(arr);
// console.log(arr);


// Создайте массив со строками.Выведите его на экран с помощью функции alert,
// а также выведите его в консоль с помощью console.log.

// let arr = ['hello', 'world', 'JS'];
// // alert(arr);
// console.log(arr);


// let arr = ['a', 'b', 'c'];

// console.log(arr[0]);
// console.log(arr[1]);
// console.log(arr[2]);

// let arr = [1, 2, 3];

// console.log(arr[0]);
// console.log(arr[1]);
// console.log(arr[2]);

// let arr = [1, 2, 3];

// console.log(arr[0] + arr[1] + arr[2]);

// let arr = ['a', 'b', 'c', 'd']; // => 'a+b+c+d'

// console.log(arr[0] + '+' + arr[1] + '+' + arr[2] + '+' + arr[3]);

// let arr = ['a', 'b', 'c'];
// console.log(arr.length);

// let arr = [1, 2, 3];
// console.log(arr[arr.length - 1])

// Создайте массив с произвольными элементами. Выведите на экран количество элементов в этом массиве.

// let arr = [1, 3, 45, 6, 'ad', '1'];
// console.log(arr.length);


// Создайте массив с произвольными элементами. Выведите на экран последний элемент этого массива.

// let arr = [1, 3, 45, 6, 'ad', '1'];
// console.log(arr[arr.length - 1]);

// Изменение элементов массива в JavaScript

// let arr = ['a', 'b', 'c'];

// arr[0] = '!';
// console.log(arr); // выведет ['!', 'b', 'c']

// Создайте массив с элементами 'a', 'b', 'c'. Запишите вместо первого элемента число 1, вместо второго - 2, вместо третьего - 3.

// let arr = ['a', 'b', 'c'];

// arr[0] = 1;
// arr[1] = 2;
// arr[2] = 3;

// console.log(arr);

// Перезапись элементов

// let arr = ['a', 'b', 'c'];

// arr[0] = arr[0] + '!';
// arr[1] = arr[1] + '!';
// arr[2] = arr[2] + '!';

// console.log(arr); // выведет ['a!', 'b!', 'c!']

//  +=

// let arr = ['a', 'b', 'c'];

// arr[0] += '!';
// arr[1] += '!';
// arr[2] += '!';

// console.log(arr); // выведет ['a!', 'b!', 'c!']

// Создайте массив с числами. Прибавьте к каждому элементу массива число 3. Выведите на экран измененный массив.

// let arr = [1, 2, 3, 4, 5];

// arr[0] += 3;
// arr[1] += 3;
// arr[2] += 3;
// arr[3] += 3;
// arr[4] += 3;

// console.log(arr);

// Инкремент и декремент ++ --

// let arr = [1, 2, 3, 4];

// arr[0]++;
// ++arr[1];
// arr[2]--;
// --arr[3];

// console.log(arr); // выведет [2, 3, 2, 3]

// Создайте массив с элементами 1, 2 и 3. С помощью оператора ++ увеличьте каждый элемент массива на единицу.

// let arr = [1, 2, 3];

// arr[0]++;
// arr[1]++;
// arr[2]++;

// console.log(arr);

// Добавление элементов по ключам JavaScript

// let arr = [];

// arr[0] = 'a';
// arr[1] = 'b';
// arr[2] = 'c';

// console.log(arr); // выведет ['a', 'b', 'c']

// let arr = ['a', 'b', 'c'];

// arr[3] = 'd';
// console.log(arr); // выведет ['a', 'b', 'c', 'd']

// С помощью описанного приема создайте массив с элементами 1, 2 и 3.

// let arr = [];

// arr[0] = 1;
// arr[1] = 2;
// arr[2] = 3;
// console.log(arr);

// let arr = [1, 2, 3];

// arr[3] = 4;
// arr[4] = 5;

// console.log(arr);

// Разреженные массивы в JavaScript

// let arr = ['a', 'b', 'c'];

// arr[4] = '!';

// console.log(arr);

// console.log(arr.length); // 5

// let arr = [];

// arr[3] = 'a';
// arr[8] = 'b';

// console.log(arr.length);

// Добавление элементов через push в JavaScript

// let arr = [];

// arr.push('a');
// arr.push('b');
// arr.push('c');

// console.log(arr);

// let arr = [];

// arr.push('1');
// arr.push('2');
// arr.push('3');

// console.log(arr);

// let arr = [1, 2, 3];
// arr.push(4);
// arr.push(5);

// console.log(arr);


// let arr = ['a', 'b', 'c'];
// let key = 0;

// console.log(arr[key]);
// console.log(arr[0]);

// let arr = ['a', 'b', 'c'];

// let key = 2;

// console.log(arr[key]);

// let arr = [1, 2, 3, 4, 5];

// let key1 = 1;
// let key2 = 2;

// console.log(arr[key1] + arr[key2]);


// let arr = ['a', 'b', 'c', 'd', 'e'];

// delete arr[1];
// delete arr[3];

// console.log(arr.length);

// let arr = [1, 2, 3, 4, 5, 6];
// console.log(arr[arr.length - 1]);

// let arr = [1, 2, 3, 4, 5];
// console.log(arr[0] + arr[1] + arr[2] + arr[3] + arr[4]);

// let arr = [1, 2, 3, 4, 5];
// console.log(arr.length);

// let arr = [1, 2, 3, 4, 5];
// console.log(arr.length);

// Объекты в JavaScript

// let obj = {
//     1: 'Понедельник',
//     2: 'Вторник',
//     3: 'Среда',
//     4: 'Четверг',
//     5: 'Пятница',
//     6: 'Суббота',
//     7: 'Пятница',
// };

// console.log(obj);

// let obj = {
//     user: 'John123',
//     name: 'John',
//     surname: 'Pitz',
//     old: '21',
//     profession: 'front-end developer'
// };

// console.log(obj['user'] + ' ' + obj['name'] + ' ' + obj['surname']);

// let date = {
//     years: '2022',
//     month: 'november',
//     day: '28'
// };

// console.log(date.years + '-' + date.month + '-' + date.day);

// let obj = {
//     '1a': 1,
//     'b2': 2,
//     'c-c': 3,
//     'd 4': 4,
//     'e5': 5
// };

// console.log(obj['1a']);
// console.log(obj.b2);
// console.log(obj['c-c']);
// console.log(obj['d 4']);
// console.log(obj.e5);

// let obj = { x: 1, y: 2, z: 3 };

// obj.x *= obj.x;
// obj.y *= obj.y;
// obj.z *= obj.z;

// console.log(obj);


// let obj = {};

// obj.a = 1;
// obj.b = 2;
// obj.c = 3;

// console.log(obj);

// let obj = { 7: 'a', 50: 'b', 23: 'c' };

// console.log(obj);

// let obj = { a: 1, b: 2, c: 3 };
// let keys = Object.keys(obj);
// console.log(keys);

// Получите массив ключей следующего объекта:

// let obj = { x: 1, y: 2, z: 3 };

// let keys = Object.keys(obj);
// console.log(keys);


// let obj = { x: 1, y: 2, z: 3 };

// console.log(Object.keys(obj).length);

// let obj = { x: 1, y: 2, z: 3 };
// let key = 'x';

// console.log(obj[key]);


// let obj = { x: 1, y: 2, z: 3 };
// console.log(obj['x']);

// let obj = { x: 1, y: 2, z: 3 };
// let key = 'x';
// console.log(obj[key]);


// // let obj = { x: 1, y: 2, z: 3 };

// let prop = 'x';
// console.log(obj[prop]);

// let obj = { x: 1, y: 2, z: 3 };

// let prop = 'x';
// console.log(obj[prop]);


// Вычисляемые свойства в JavaScript

// let obj = {
//     a: 1,
//     b: 2,
//     c: 3
// };

// let key = 'a';

// // let obj = {
// //     [key]: 1,
// //     b: 2,
// //     c: 3
// // };


// let obj = {
//     [key + '1']: 1,
//     [key + '2']: 2,
//     [key + '3']: 3
// };
// console.log(obj);


// let key = 'x';

// let obj = {
//     [key]: 1,
//     y: 2,
//     z: 3
// };

// console.log(obj);

// let key1 = 'x';
// let key2 = 'y';
// let key3 = 'z';

// let obj = {
//     [key1]: 1,
//     [key2]: 2,
//     [key3]: 3
// };

// console.log(obj);

// Оператор in в JavaScript

// let obj = { a: 1, b: 2, c: 3 };
// console.log('b' in obj); // выведет true
// console.log('x' in obj); // выведет false


// Оператор delete 

// let obj = {
//     a: 1,
//     b: 2,
//     c: 3
// };

// delete obj.b;

// console.log(obj);
// console.log(Object.keys(obj).length);


// let obj = { x: 1, y: 2, z: 3 };
// delete obj.x;

// console.log('x' in obj);

// Типизация объектов в JavaScript

// console.log( typeof {x: 1, y: 2, z: 3} );
// console.log( typeof {} );

// let obj = {x: 1, y: 2, z: 3};
// console.log( typeof obj );

// let obj = {x: 1, y: 2, z: 3};
// console.log( typeof obj['x'] );

// let arr = ['1', '2', '3'];
// console.log( typeof arr[0] );
// let arr = [1, 2, 3];
// console.log( typeof arr[0] );

// let arr = [1, 2, 3];
// console.log( typeof arr );

// console.log(typeof {}); // object

// console.log(typeof { x: 1, y: 2, z: 3 }); // object

// let obj = {x: 1, y: 2, z: 3};
// console.log( typeof obj['x'] ); // number

// console.log(typeof []); // object


// Отличаем массивы от объектов в JavaScript

// console.log(Array.isArray([])); // выведет true
// console.log(Array.isArray({})); // выведет false

///
// В JavaScript семь примитивных типов данных: string, number, boolean, null, undefined, symbol, bigint. 
// Запомните их количество и названия - это часто спрашивают на собеседованиях.
///

// const arr = ['a', 'b', 'c'];
// arr[1] = '!';
// console.log(arr);

// const arr = ['a', 'b', 'c'];
// arr = ['a', 'b', 'c'];
// console.log(arr); //eror

// let arr = [1, 2, 3, 4, 5];
// let res = arr[1] + arr[2];



// const arr = [1, 2, 3, 4, 5];
// const res = arr[1] + arr[2];

// console.log(res);

// let obj = { x: 1, y: 2, z: 3 };
// console.log(obj['x']);

// let obj = { x: 1, y: 2, z: 3 };
// let key = 'x';

// console.log(obj[key]);

// let obj = { x: 1, y: 2, z: 3 };
// let sum = obj['x'] + obj['y'] + obj['z'];

// console.log(sum);

// let obj = { x: 1, y: 2, z: 3 };
// console.log(Object.keys(obj).length);


//
// IF ELSE
//

// if (операция сравнения) {
// 	/*
// 		расположенный здесь код выполниться,
// 		если результат операция сравнения верный
// 	*/
// } else {
// 	/*
// 		расположенный здесь код выполниться,
// 		если результат операция сравнения неверный
// 	*/
// }

// Операторы больше и меньше в JavaScript

// let test = 1;

// if (test > 0) {
//     console.log('+++');
// } else {
//     console.log('---');
// }


// let test1 = 0;

// if (test1 >= 0) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// Проверьте, что переменная test больше 10.

// let test = 123;

// if (test > 10) {
//     console.log('test > 10');
// } else {
//     console.log('test < 10');
// }

// Проверьте, что переменная test меньше 10.

// let test = 1;

// if (test < 10) {
//     console.log('test < 10');
// } else {
//     console.log('test > 10');
// }

// Проверьте, что переменная test больше или равна 10.

// let test = 10;

// if (test >= 10) {
//     console.log('test > 10');
// } else {
//     console.log('test < 10');
// }

// Проверьте, что переменная test меньше или равна 10.

// let test = 11;

// if (test <= 10) {
//     console.log('test <= 10');
// } else {
//     console.log('test > 10');
// }

// == 

// let test = 0;

// if (test == 0) {
//     console.log('++');
// } else {
//     console.log('--');
// };

// Проверьте, что переменная test равна 10.

// let test1 = 0;

// if (test1 == 10) {
//     console.log('++');
// } else {
//     console.log('--');
// };

// !=

// let test = 1;

// if (test != 0) {
//     console.log('++');
// } else {
//     console.log('--');
// }

// let test = 0;

// if (test != 0) {
//     console.log('++');
// } else {
//     console.log('--');
// }

// Проверьте, что переменная test не равна 10.

// let test = 0;

// if (test != 10) {
//     console.log('++');
// } else {
//     console.log('--');
// }


// Даны переменные test1 и test2. Проверьте, что значение какой из этих переменных больше и выведите соответствующее сообщение.

// let test1 = 4;
// let test2 = 2;

// if (test1 > test2) {
//     console.log('test1>');
// } else {
//     console.log('test2>');
// }

// Даны переменные test1 и test2. Проверьте, равны ли их значения и выведите соответствующее сообщение.

// let test1 = 2;
// let test2 = 2;

// if (test1 == test2) {
//     console.log('==');
// } else {
//     console.log('!=');
// }


// let test = 'abc';

// if (test == 'abc') {
//     console.log('+++'); // сработает это
// } else {
//     console.log('---');
// }

// Даны переменные test1 и test2, содержащие строки. Проверьте, равны ли их значения и выведите соответствующее сообщение.

// let test1 = 'abc';
// let test2 = 'abc';

// if (test1 == test2) {
//     console.log('==');
// } else {
//     console.log('!==');
// }

// let test1 = '123';
// let test2 = 123;

// if (test1 == test2) {
//     console.log('==');
// } else {
//     console.log('!==');
// }

/// === 

// let a = 1;
// let b = '1';

// if (a === b) {
//     console.log('==');
// } else {
//     console.log('!==');
// }

// Проверьте, что переменная num больше нуля и меньше 5.

// let num = 4;

// if (num > 0 && num < 5) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// Проверьте, что переменная num больше или равна 10 и меньше или равна 20.

// let num = 40;

// if (num >= 10 && num <= 20) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// Проверьте, что переменная num1 равна или меньше 1, а переменная num2 больше или равна 3.

// let num1 = 1;
// let num2 = 3;

// if (num1 <= 1 && num2 >= 3) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// Логическое ИЛИ в JavaScript ||

// let num1 = 10;
// let num2 = -5;

// if (num1 > 0 || num2 > 0) {
// 	console.log('+++'); // сработает это
// } else {
// 	console.log('---');
// }

// let num1 = -10;
// let num2 = -10;

// if (num1 >= 0 || num2 >= 0) {
// 	console.log('+++');
// } else {
// 	console.log('---');
// }

// let num1 = 0;
// let num2 = 5;

// if (num1 >= 0 || num2 >= 0) {
// 	console.log('+++');
// } else {
// 	console.log('---');
// }

// let num = 2;
// if (num == 0 || num > 1 && num < 5) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// let num = 3;

// if (num > 5 || (num > 0 && num < 3)) {
//     console.log('+++');
// } else {
// console.log('---');
// }

// let num = 19;

// if (num == 9 || (num > 10 && num < 20) || (num > 20 && num < 30)) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// Инвертирование логических выражений в JavaScript

// if (num > 0 && num < 5) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// // =>

// if (num <= 0 || num >= 5) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// //

// if (!(num > 0 && num < 5)) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// let num1 = 0;
// let num2 = 11;

// if (!(num1 > 0 || num2 < 10)) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// boolean true/false
// let test = true;

// if (test === true) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

//

// let test = false;

// if (test === false) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

//Сравнение значений с булевым типом в JavaScript
// В прошлом примере мы сравнивали свойство test ===, если в переменной test будет всегда true, false - можно использовать == 

// let test = true; // тут пишем или true, или false

// if (test == true) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// let test = 1;

// if (test == true) {
//     console.log('+++'); // сработает это
// } else {
//     console.log('---');
// }

// let test = 0;

// if (test == true) {
// 	console.log('+++');
// } else {
// 	console.log('---'); // сработает это
// }


// Фактически такое сравнение можно явно переписать в следующем виде:

// let test = 1;

// if (Boolean(test) == true) {
// 	console.log('+++');
// } else {
// 	console.log('---');
// }

// Вспомните и напишите, какие значения при приведении к логическому типу дают false.

// Boolean(false); // false
// Boolean(undefined); // false
// Boolean(null); // false
// Boolean(''); // false
// Boolean(NaN); // false
// Boolean(0); // false
// Boolean(-0); // false
// Boolean(0 n); // false

// Boolean(true); // true
// Boolean('hi'); // true
// Boolean(1); // true
// Boolean([]); // true
// Boolean([0]); // true
// Boolean([1]); // true
// Boolean({}); // true
// Boolean({ a: 1 }); // true

// let test = 3 * 'a';

// if (test == true) {
// 	console.log('+++');
// } else {
// 	console.log('---');
// }


// Сокращенная форма проверки на истину в JavaScript

// let test = true;

// if (test == true) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// Сокращаем test == true => if(test)

// let test = true;

// if (test) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// let test = true;

// if (test) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// let test = true;

// if (test === false) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// let test = true;

// if (test !== true) {
// 	console.log('+++');
// } else {
// 	console.log('---');
// }

// let test = true;

// if (!test) {
// 	console.log('+++');
// } else {
// 	console.log('---');
// }

// let test = true;

// if (!test) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// let test = true;

// if (!test) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// let test = true;

// if (!test) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// let test = false;

// if (test) {
// 	console.log('+++');
// } else {
// 	console.log('---');
// }

// let test;

// if (test) {
// 	console.log('+++');
// } else {
// 	console.log('---');
// }

// let test = '0';

// if (test) {
// 	console.log('+++'); +
// } else {
// 	console.log('---');
// }

// let test1 = true;
// let test2 = true;

// if (test1 && test2) {
// 	console.log('+++');
// } else {
// 	console.log('---');
// }

// let test1 = true;
// let test2 = true;

// if (test1 === true && test2 === true) {
// 	console.log('+++');
// } else {
// 	console.log('---');
// }

// let test1 = true;
// let test2 = true;

// if (test1 && test2) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// let test1 = true;
// let test2 = true;

// if (test1 && (!test2)) {
//     console.log('+++');
// } else {
//     console.log('---');
// }


// let test1 = true;
// let test2 = true;

// if (!(test1 && test2)) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// let test1 = true;
// let test2 = true;

// if ((!test1) && test2) {
//     console.log('+++');
// } else {
//     console.log('---');
// }


// let test1 = true;
// let test2 = true;
// let test3 = true;

// if (test1 && test2 && test3) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// let test1 = true;
// let test2 = true;
// let test3 = true;

// if (test1 || (test2 && test3)) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// let test1 = true;
// let test2 = true;
// let test3 = true;

// if (test1 || (test2 && test3)) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// let test1 = 10;

// if (test1 == 10) {
//     console.log('Yes');
// }

// let test = 10;
// if (test > 0)
//     console.log('+++');
// else
//     console.log('---');

// let test = 10;
// if (test > 0)
//     console.log('+++');

// let num = 1;

// if (num == 1) {
//     console.log('value1');
// } else if (num == 2) {
//     console.log('value2');
// } else if (num == 3) {
//     console.log('value3');
// }

// let num = 4;

// if (num == 1) {
//     console.log('1');
// } else if (num == 2) {
//     console.log('2');
// } else if (num == 3) {
//     console.log('3');
// } else {
//     console.log('Error number');
// }

// В переменной day лежит какое - то число из интервала от 1 до 31.
// Определите в какую декаду месяца попадает это число(в первую, вторую или третью).

// let day = 2;

// if (day >= 1 && day < 10) {
//     console.log('First');
// } else if (day >= 11 && day < 20) {
//     console.log('Second');
// } else if (day >= 21 && day < 31) {
//     console.log('Three');
// } else {
//     console.log('Not true number');
// }

// Модифицируйте предыдущую задачу так, чтобы, если в переменной day 
// будет не число от 1 до 31, выдавалось сообщение об ошибке.

// Вложенные конструкции if-else в JavaScript

// Пусть в переменной num хранится число. Если это число попадает в диапазон от 10 до 99, то найдите сумму цифр этого числа. 
// Если полученная сумма меньше или равна 9, то выведите сообщение о том, 
// что сумма цифр однозначна, в противном случае выведите сообщение о том, что сумма цифр двухзначна.

// let num = 11;
// let sum = String(num);
// let sumFirst = Number(sum[0]);
// let sumSecond = Number(sum[1]);

// if (num >= 10 && num <= 99) {
//     console.log(sumFirst + sumSecond);
// }
// if (num <= 9) {
//     console.log('Число однозначно');
// } else {
//     console.log('Сумма цифр двухзначна');
// }

// Конструкция switch-case в JavaScript


// switch (переменная) {
// 	case 'значение1':
// 		/*
// 			здесь код, который выполнится в случае,
// 			если переменная имеет значение1
// 		*/
// 	break;
// 	case 'значение2':
// 		/*
// 			здесь код, который выполнится в случае,
// 			если переменная имеет значение2
// 		*/
// 	break;
// 	case 'значение3':
// 		/*
// 			здесь код, который выполнится в случае,
// 			если переменная имеет значение3
// 		*/
// 	break;
// 	default:
// 		/*
// 			здесь код, который выполнится в случае,
// 			если не совпала ни с одним значением
// 		*/
// 	break;
// }

// let num = 1;

// switch (num) {
//     case 1:
//         console.log('value1');
//         break;
//     case 2:
//         console.log('value2');
//         break;
//     case 3:
//         console.log('value3');
//         break;
//     default:
//         console.log('incorrect value');
//         break;
// }

// Переписать код

// let lang = 'ru';

// if (lang == 'ru') {
//     console.log('рус');
// } else if (lang == 'en') {
//     console.log('анг');
// } else if (lang == 'de') {
//     console.log('нем');
// } else {
//     console.log('язык не поддерживается');
// }

// let lang = 'ru';

// switch (lang) {
//     case 'ru':
//         console.log('рус');
//         break;
//     case 'eng':
//         console.log('анг');
//         break;
//     case 'de':
//         console.log('нем');
//         break;
//     default:
//         console.log('incorrect value');
//         break;
// }

// Необязательность break в конструкции switch-case в JavaScript

// let num = 1; // пусть здесь число 1

// switch (num) {
//     case 1:
//         console.log(1); // сработает это
//     case 2:
//         console.log(2); // сработает и это
//     case 3:
//         console.log(3); // сработает и это
// }

// Тернарный оператор в JavaScript

// let переменная = условие ? значение1 : значение2;

// let age = 21;
// let adult = age >= 18 ? true : false;
// console.log(adult);

// let num = 1;
// let res;

// if (num >= 0) {
//     res = '1';
// } else {
//     res = '2';
// }

// console.log(res);

// let num = -1;
// let res = num >= 0 ? '1' : '2';


// console.log(res);


// let a = 2 * (3 - 1);
// let b = 6 - 2;

// let a = 2 * (3 - 1);
// let b = 6 - 2;

// let result = a == b;

// console.log(result);

// let a = 5 * (7 - 4);
// let b = 1 + 2 + 7;

// let result = a > b;
// console.log(result);

// let a = 2 ** 4;
// let b = 4 ** 2;

// let result = a != b;
// console.log(result);

// Функция confirm в JavaScript

// let ok = confirm('pidr?');
// console.log(ok);

// let ok = confirm('Текст вопроса');

// if (ok) {
//     alert('Вы ответили да !');
// } else {
//     console.log('вы ответили нет');
// }

// Спросите у пользователя, есть ли ему уже 18 лет. 
// Если есть - выведите на экран алерт с текстом для взрослых, а если нет, выведите сообщение о том, что доступ пользователю запрещен.

// let ok = confirm('Вам есть 18 лет?');

// if (ok) {
//     alert('Хорошо смотрите xd!');
// } else {
//     alert('Доступ запрещен');
// }

// let age = 17;
// let adult;

// if (age >= 18) {
//     adult = true;
// } else {
//     adult = false;
// }

// console.log(adult);

// let age = 17;
// let adult;

// if (age >= 18) {
//     adult = true;
// } else {
//     adult = false;
// }

// console.log(adult);

// let min = 41;

// if (min >= 0 && min <= 20) {
//     console.log('1');
// }
// if (min >= 21 && min <= 40) {
//     console.log('2');
// }
// if (min >= 41 && min <= 60) {
//     console.log('3');
// }

// В переменной arr содержится некоторый массив с числами. Напишите условие, которое проверит, что в массиве 3 элемента. 
// Если это так, выведите на экран сумму элементов массива.

// let arr = [1, 2, 3];

// if (arr.length == 3) {
//     let result = arr[0] + arr[1] + arr[2];
//     console.log(result);
// } else {
//     console.log('Массив содержит больше 3 элементов!');
// }

// Дана переменная, содержащая некоторую строку. Проверьте, что эта строка начинается на символ 'a'.

// let str = 'bvf';

// if (str[0] == 'a' || str[0] == 'b') {
//     console.log('Массив начинается с "a" или с "b"');
// } else {
//     console.log('Массив не начинается с "a" или с "b"');
// }

// Дано целое число. Напишите условие, которое проверит, равна ли последняя цифра этого числа нулю.

// let num = 20;

// if (String(num)[1] == 0) {
//     console.log('ravno 0');
// } else {
//     console.log('ne ravno');
// }

// Пусть в переменной num хранится число. 
// Определите, четное число или нет. Число будет четным, если последний символ равен 0, 2, 4, 6 или 8, 
// и нечетным в противном случае.

// let num = 22;
// let numEven = String(num);
// let numEvenSec = numEven[numEven.length - 1];


// if (numEvenSec == 2 || numEvenSec == 4 || numEvenSec == 6 || numEvenSec == 8) {
//     console.log(num);
// } else {
//     console.log('Не четное число');
// }

// Как известно, четные числа делятся на 2 без остатка, а нечетные - с остатком. 
// Пусть у вас дано число. С помощью оператора % и конструкции if проверьте четное это число или нет.

// let a = 5;
// let b = 2;
// let resul = a % b;

// if (resul === 0) {
//     console.log('Четное');
// } else {
//     console.log('Не четное : ' + resul);
// }

// Дано число. Проверьте, что оно делится на 3.

// let a = 23;
// let b = 3;
// let resul = a % b;

// if (resul === 0) {
//     console.log('delitsa');
// } else {
//     console.log('Ne delitsa  : остаток ' + resul);
// }

// Практика

// let num1 = 1;
// let num2 = 2;
// let num3 = num1 + num2;

// if (num3 == 3) {
//     console.log('+++');
// } else {
//     console.log('---');
// }


// let num1 = '1';
// let num2 = '2';
// let num3 = Number(num1) + Number(num2);

// if (num3 == 3) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// let num1 = '1';
// let num2 = '2';

// if (Number(num1) + Number(num2) === 3) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// let num = 123;
// let num2 = String(num);

// if (num2[0] == 1) {
//     console.log('+++');
// } else {
//     console.log('---');
// }


// let num = 12;

// if (String(num.length == 2)) {
//     console.log('+++');
// } else {
//     console.log('---');
// }

// let num = 12;

// if (String(num).length == 2) {
//     console.log('+++');
// } else {
//     console.log('---');
// }


// let num = '123033'; // берем в кавычки, чтобы обращаться к цифрам


// let sum1 = Number(num[0]) + Number(num[1]) + Number(num[2]);
// let sum2 = Number(num[3]) + Number(num[4]) + Number(num[5]);




// if (sum1 === sum2) {
//     console.log('суммы равны');
// } else {
//     console.log('суммы не равны');
// }


// Накопление чисел в циклах JavaScript

// let res = 0;

// for (let i = 1; i <= 100; i++) {
//     res += i;
// }

// console.log(res);

// Найдите сумму четных чисел от 2 до 100.

// let res = 0;

// for (let i = 2; i <= 100; i++) {
//     if (i % 2 === 0) {
//         res += i;
//         console.log(i)
//     }
// }

// console.log(res);


// Найдите сумму нечетных чисел от 1 до 99.
// let res = 0;
// for (let i = 1; i <= 99; i++) {
//     if (i % 2 !== 0) {
//         res += i;
//         console.log(i);
//     }
// }

// console.log(res);

// Найдите произведение целых чисел от 1 до 20.

// let res = 0;

// for (let i = 1; i <= 20; i++) {
//     res = i * i;
//     console.log(i);
// }
// console.log(res);

// Накопление элементов массивов в циклах JavaScript

// let arr = [1, 2, 3, 4, 5];
// let res = 0;

// for (let elem of arr) {
//     res += elem;
// }

// console.log(res); // искомая сумма


// Найдите сумму элементов этого массива.
// let arr = [2, 5, 9, 3, 1, 4];
// let res = 0;

// for (let elem of arr) {
//     res += elem;
// }

// console.log(res);

// let arr = [2, 5, 9, 3, 1, 4];
// let res = 0;

// for (let elem of arr) {
//     if (elem % 2 === 0) {
//         res += elem;
//     }
// }

// console.log(res);

// let arr = [2, 5, 9, 3, 1, 4];
// let res = 0;

// for (let elem of arr) {
//     if (elem = elem ** 2) {
//         res += elem;
//         console.log(elem);
//     }
// }

// console.log(res);


// let arr = [2, 5, 9, 3, 1, 4];
// let res = 1;

// for (let elem of arr) {
//     res *= elem;
// }

// console.log(res);

// Формирование строк через циклы в JavaScript

// let str = '';

// for (let i = 0; i < 10; i++) {
// 	str += 'x';
// }

// console.log(str); // выведет 'xxxxxxxxxx'


// let str = '';

// for (let i = 1; i <= 5; i++) {
// 	str += i;
// }

// console.log(str); // выведет '12345'

// С помощью цикла сформируйте строку, заполненную 5-тью дефисами.

// let str = '';

// for (let i = 0; i < 5; i++) {
//     str += '-';
// }

// console.log(str);

// С помощью цикла сформируйте строку '123456789'.

// let num = '';

// for (let i = 1; i < 10; i++) {
//     num += i;
// }

// console.log(num);

// С помощью цикла сформируйте строку '987654321'.

// let num = '';

// for (let i = 9; i > 0; i--) {
//     num += i;
// }

// console.log(num);

// С помощью цикла сформируйте строку '-1-2-3-4-5-6-7-8-9-'.

// let num = '';

// for (let i = 1; i < 10; i++) {
//     num += '-' + i;
// }

// num += '-';

// console.log(num);

// Цифры числа при переборе циклом JavaScript

// Переберите циклом числа от 10 до 1000 и выведите в консоль первую цифру каждого числа.

// for (let i = 10; i <= 1000; i++) {
//     let str = String(i);
//     console.log(str[0]);
// }

// Переберите циклом числа от 10 до 1000 и выведите в консоль сумму первой и второй цифры каждого числа.

// for (let i = 10; i <= 1000; i++) {
//     let str = String(i);
//     let sum = Number(str[0]) + Number(str[1]);
//     console.log(sum);
// }


// Переберите циклом числа от 10 до 1000 и выведите те числа, первая цифра которых равна 1.

// for (let i = 10; i <= 1000; i++) {
//     let str = String(i);
//     if (str[0] == '1') {
//         console.log(str);
//     }
// }

// Переберите циклом числа от 10 до 1000 и выведите на экран те числа, сумма двух первых цифр которых равна 5.

// for (let i = 10; i <= 1000; i++) {
//     let str = String(i);
//     if (Number(str[0]) + Number(str[1]) == '5') {
//         console.log(str);
//     }
// }

// Дан массив с числами. Запустите цикл, который будет по очереди выводить элементы этого массива в консоль до тех пор, 
// пока не встретится элемент со значением 0. 
// После этого цикл должен завершить свою работу.

// let arr = [1, 2, 3, 4, 5, 0];

// for (let elem of arr) {
//     if (elem == 3) {
//         break;

//     }
//     console.log(elem);
// }


// Дан массив с числами. Найдите сумму элементов, расположенных от начала массива до первого отрицательного числа.

// let arr = [1, 2, 3, -4, 4, 5];
// let sum = 0;
// for (let elem of arr) {
//     if (elem <= 0) {
//         break;
//     }
//     sum += elem;

//     console.log(sum);
// }

// Дан массив с числами. Найдите позицию первого числа 3 в этом массиве (считаем, что это число обязательно есть в массиве).


// let arr = [1, 2, 5, 6, 4, 3, 2];

// for (let elem of arr) {

//     if (arr[elem] === 3) {

//         console.log(elem);

//     }

// }

// Определите, сколько целых чисел, начиная с числа 1, нужно сложить, чтобы сумма получилась больше 100.

// let sum = 0;
// for (let i = 1; i <= 100; i++) {
//     sum += i;
//     if (sum > 100) {
//         console.log(i);
//         console.log(sum);
//         break;
//     }
// }


// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];

// for (let elem of arr) {
// 	let result;

// 	if (elem % 2 == 0) {
// 		result = elem * elem;
// 	} else if (elem % 3 == 0) {
// 		result = elem * elem * elem;
// 	} else {
// 		continue; // перейдем на новую итерацию цикла
// 	}

// 	console.log(result); // выполнится, если делится на 2 или 3
// }

// for (let i = 1; i <= 9; i++) {
//     for (let j = 1; j <= 3; j++) {
//         document.write(i);
//     }

// }

// 11 12 13 21 22 23 31 32 33

// let str = '';
// for (let i = 1; i <= 3; i++) {
//     for (let j = 1; j <= 3; j++) {
//         str = str + i + j + ' ';
//     }
//     document.write(str);
//     str = '';
// }


// let arr = [];

// for (let i = 1; i <= 5; i++) {
//     arr.push(i);
// }

// console.log(arr); // выведет [1, 2, 3, 4, 5]

// Используя цикл и метод push заполните массив числами от 1 до 10.

// let arr = [];

// for (let i = 1; i <= 10; i++) {
//     arr.push(i);
// }

// console.log(arr);

// Используя цикл и метод push заполните массив 10-ю буквами 'x'.

// let arr = [];

// for (let i = 1; i <= 10; i++) {
//     arr.push('x');
// }
// console.log(arr);

// Дан массив с числами. Переберите его циклом и запишите в новый массив только положительные из чисел.

// let arr = [2, 2, 3, 4, 3, -12, 6, 7, 8, -13, -23, -34];
// let arrSecond = [];


// for (let i = 0; i <= arr.length; i++) {
//     if (arr[i] >= 0) {
//         arrSecond.push(arr[i]);
//     }
// }
// console.log(arrSecond);

// Дан массив с числами. Переберите этот массив циклом и возведите каждый элемент этого массива в квадрат.

// let arr = [1, 2, 3, 4, 5, 6];

// for (let i = 0; i < arr.length; i++) {
//     arr[i] = arr[i] * arr[i];
// }

// console.log(arr);

// Дан массив с числами. Переберите этот массив циклом и отнимите от каждого элемента единицу.


// let arr = [13, 2, 33, 4, 5, 6];

// for (let i = 0; i < arr.length; i++) {
//     arr[i] = arr[i] - 1; // + 10
// }

// console.log(arr);

// Заполнение объектов через цикл в JavaScript

// let keys = ['a', 'b', 'c', 'd', 'e'];
// let values = [1, 2, 3, 4, 5];

// let obj = {};

// for (let i = 0; i <= 4; i++) {
//     let key = keys[i];
//     let value = values[i];

//     obj[key] = value;
// }

// console.log(obj);

// let obj = {};

// for (let i = 0; i <= 4; i++) {
//     obj[keys[i]] = values[i];
// }

// console.log(obj);


// let arr1 = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'];
// let arr2 = [1, 2, 3, 4, 5, 6, 7];

// let obj = {};

// for (let i = 0; i <= 6; i++) {
//     obj[arr1[i]] = arr2[i];
// }

// console.log(obj);


// Переберите этот объект циклом и запишите в новый объект те элементы, которые являются четными числами.



// let obj = { a: 1, b: 2, c: 3, d: 4, e: 5 };
// let objFirst = [];
// let objSec = [];

// let objEven = {};

// for (let key in obj) {
//     if (obj[key] % 2 == 0) {
//         objFirst.push(key);
//         objSec.push(obj[key]);
//     }
// }

// for (let i = 0; i <= 2; i++) {
//     objEven[objFirst[i]] = objSec[i];


// }

// console.log(objFirst);
// console.log(objSec);
// console.log(objEven);



// var p = {
//     "p1": "value1",
//     "p2": "value2",
//     "p3": "value3"
// };
// for (var key in p) {
//     if (p.hasOwnProperty(key)) {
//         console.log(key + " -> " + p[key]);
//     }
// }

// let obj = { a: 1, b: 2, c: 3, d: 4, e: 5 };
// let box = {};
// for (let key in obj) {
//     const value = obj[key];
//     if (value % 2 === 0) {
//         box[key] = value;
//     }
// }

// console.log(box);


// Переберите этот объект циклом и создайте новый объект так, чтобы его ключами стали элементы старого объекта, а значениями - ключи старого объекта.


// let obj = { a: 1, b: 2, c: 3, d: 4, e: 5 };
// let box = {};
// for (let key in obj) {
//     const value = obj[key];

//     box[value] = key;
// }

// console.log(box);


// let obj = { x: 1, y: 2, z: 3 };
// // Переберите этот объект циклом и возведите каждый элемент этого объекта в квадрат.

// for (let key in obj) {
//     obj[key] = obj[key] * obj[key];
// }

// console.log(obj);

// let obj = { x: 1, y: 2, z: 3 };
// // Переберите этот объект циклом и увеличьте каждый элемент этого объекта на единицу.

// for (let key in obj) {
//     obj[key] = obj[key] + 1;
// }

// console.log(obj);

// flag

// let arr = ['a', 'b', 's', 'd', 'e'];
// let flag = false;

// for (let elem of arr) {
//     if (elem == 'c') {
//         flag = true;
//         break;
//     }
// }

// if (flag === true) {
//     console.log('+++');
// } else {
//     console.log('---');
// }


// Напишите код, который будет проверять число на то, простое оно или нет.

// let num = 3;
// let flag = false;

// for (let i = 4; i < num; i++) {
//     for (let j = 2; j < i; j++) {
//         if (i % j == 0) {
//             flag = true;
//             break;
//         }
//     }
// }

// if (flag === true) {
//     console.log('Простое');
// }

/// win // как оказалось не вин, ебал я рот


// Дан массив с числами. Переберите его циклом и в каждой итерации цикла выведите два предыдущих элемента массива.


// let arr = [1, 2, 3, 4, 5, 7];

// for (let i = 4; i < arr.length; i++) {
//     console.log(arr[i - 2]);
// }



// let arr = [1, 2, 3, 4, 5, 7, 4, 5, 7, 8];
// // let sum = 0;
// for (let i = 4; i < arr.length; i++) {
//     console.log(arr[i - 2]);
//     console.log(arr[i]);
//     // console.log(arr[i - 2] + arr[i]);
// }


// Дан массив с числами.
// Переберите его циклом и в каждой итерации цикла выведите сумму предыдущего,
// текущего и следующего элементов массива.

// let arr = [1, 2, 3, 4, 5, 7];


// for (let i = 4; i < arr.length; i++) {
//     arr[i - 2]

// }


// let arr1 = [1, 2, 3, 4, 5];

// for (let i = 1; i < arr1.length; i++) {
//     console.log(arr1[i - 1] + arr1[i]);
// }


// Возьмите из этого массива те элементы, у которых первая цифра 1 или 2, и найдите их сумму.

// let arr = [10, 20, 30, 40, 21, 32, 51];
// let sum = 0;

// for (let elem in arr) {
//     let elemStr = String(arr[elem]);
//     if (elemStr[0] == 1 || elemStr[0] == 2) {
//         let elemNum = Number(elemStr);

//         sum += elemNum;
//     }

// }

// console.log(sum);







// Возьмите из этого массива те элементы, у которых первая цифра 1 или 2, и найдите их сумму.

// let arr = [10, 20, 30, 32, 21, 23, 12];
// let sum = 0;

// for (let elem in arr) {
//     let elemStr = String(arr[elem]);
//     if (elemStr[0] == 1 || elemStr[0] == 2) {
//         // let elemNum = Number(elemStr);
//         sum += +elemStr;
//     }
// }

// console.log(sum);

// let obj = { a: 10, b: 20, c: 30, d: 40, e: 50 };
// let sum = 0;

// for (let key in obj) {
//     let value = obj[key];
//     if (value[0] === '1' || value === '2') {
//         sum += +key;

//         console.log('1');
//     }
//     console.log(obj[key]);
// }

// console.log(sum);


// Исправьте ошибки, допущенные в следующем коде:

// let obj = { a: 10, b: 20, c: 30, d: 40, e: 50 };
// let sum = 0;

// for (let elem in obj) {
//     if (elem[0] === '1' && elem[0] === '2') {
//         sum += +elem;
//     }
// }

// console.log(sum);


// for (let i = 10; i >= 0; i--) {
//     console.log(i);
// }

// let i = 0;

// while (i < 10) {
//     i++;
//     console.log(i);
// }

// let res = 0;


// for (let i = 1; i <= 10; i++) {
//     res += i;
// }

// console.log(res);

// let res = 1;

// for (let i = 1; i <= 10; i++) {
//     console.log(i);
//     res *= i;
// }

// console.log(res);


// let arr = ['1', '2', '3', '4', '5'];
// let sum = 0;

// for (let elem of arr) {
//     console.log(elem);
//     const elemN = Number(elem);
//     sum += elemN;
// }

// console.log(sum); // должно вывести 15


// let arr = ['1', '2', '3', '4', '5'];
// let sum = 0;

// for (let elem of arr) {

//     sum += +elem;
// }

// console.log(sum); // должно вывести 15

// let arr = ['1', '2', '3', '4', '5'];
// let sum = 0;

// for (let elem of arr) {
//     sum += +elem;
// }

// console.log(sum); // должно вывести 15


// let arr = ['1', '2', '3', '4', '5'];
// let sum = 0;

// for (let i = 0; i < arr.length; i++) {
//     sum += +arr[i];
// }

// console.log(sum); // почему-то выводит NaN


// let arr = ['1', '2', '3', '4', '5'];
// let sum = 0;

// for (let i = 0; i < arr.length; i++) {
//     sum += +arr[i];
// }

// console.log(sum); // почему-то выводит не 15

// let arr = ['1', '2', '3', '4', '5'];
// let sum = 0;

// for (let i = 0; i < arr.length; i++) {
//     sum += +arr[i];
// }

// console.log(sum); // почему-то выводит не 15

// let arr = [1, 2, 3, 4, 5];
// let arrS = [];
// for (let elem of arr) {
//     elem = elem * elem;
//     arrS.push(elem);

// }

// console.log(arrS);


// let arr = [];

// for (let i = 1; i <= 5; i++) {
//     arr.push(i);
// }

// console.log(arr);

// let obj = { a: 1, b: 2, c: 3 };
// let sum = 0;

// for (let elem in obj) {
//     const value = obj[elem]
//     sum += value;


// }

// console.log(sum);

// let obj = { a: 1, b: 2, c: 3 };
// let sum = 0;

// for (let key in obj) {

//     sum += obj[key];
// }

// console.log(sum);

// let arr = [1, 2, 3, 4, 5];
// let res = '';

// for (let elem of arr) {

//     if (elem == 3) {
//         res = '+++';
//         break;
//     } else {
//         res = '---';
//     }
// }

// console.log(res);

// let arr = [];

// for (let i = 1; i <= 5; i++) {
//     arr.push(i);
// }

// console.log(arr);


// let arr = [1, 2, 3, 4, 5];
// let res = false;

// for (let elem of arr) {
// 	if (elem === 3) {
// 		 res = true;
// 		break;
// 	}
// }

// console.log(res);

// let arr = [1, 2, 3, 4, 5];

// for (let elem of arr) {
//     if (elem % 2 == 0) {
//         console.log(elem);
//     }
// }

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];
// let res = [];
// for (let elem of arr) {
//     if (elem % 2 != 0) {
//         res.push(elem);
//     }
// }

// console.log(res);

// Выведите с помощью цикла столбец чисел от 1 до 100.

// for (let i = 1; i <= 100; i++) {
//     console.log(i);
// }

// Выведите с помощью цикла столбец чисел от 100 до 1.

// for (let i = 100; i > 0; i--) {
//     console.log(i)
// }

// Выведите с помощью цикла столбец четных чисел от 1 до 100.

// for (let i = 1; i < 100; i++) {
//     if (i % 2 == 0) {
//         console.log(i);
//     }
// }

// Заполните массив 10-ю иксами с помощью цикла.

// let arr = [];

// for (let i = 1; i <= 10; i++) {
//     arr.push('x')
// }
// console.log(arr);

// Дан массив с числами. С помощью цикла выведите только те элементы массива, которые больше нуля и меньше 10-ти.

// let arr = [10, 23, 43, 53, 5, 3, 6]

// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] > 0 && arr[i] < 10) {
//         console.log(arr[i]);
//     }
// }

// Дан массив с числами. С помощью цикла проверьте, что в нем есть элемент со значением 5.

// let arr = [10, 5, 4, 4]

// for (let elem of arr) {
//     if (elem == 5) {
//         console.log('+++');
//         break;
//     } else {
//         console.log('---');
//     }
// }

// Дан массив с числами. С помощью цикла найдите сумму квадратов элементов этого массива.

// let arr = [1, 4, 5, 6, 4]
// let sum = 0

// for (let elem of arr) {
//     elem = elem * elem
//     sum += elem
// }
// console.log(sum)

// Дан массив с числами. Найдите среднее арифметическое его элементов.

// let arr = [2, 4, 5, 6, 7];
// let sum = 0;


// for (let elem of arr) {
//     sum += elem;

// }



// console.log(sum / arr.length);

// Напишите скрипт, который будет находить факториал числа. 
// Факториал - это произведение всех целых чисел от единицы до заданного числа.

// let num = 2;
// let fact = 1;
// for (let i = 1; i <= num; i++) {

//     fact *= i

// }

// console.log(fact);


// Заполните массив числами от 10 до 1 с помощью цикла.

// let arr = []

// for (let i = 1; i <= 10; i++) {
//     arr.push(i);
// }
// console.log(arr);

// Дан массив с числами. Числа могут быть положительными и отрицательными. Найдите сумму положительных элементов массива.

// let arr = [1, 4, 5, 6, -2, -3, -4]
// let sum = 0

// for (let elem of arr) {
//     if (elem > 0) {
//         sum += elem
//     }
// }

// console.log(sum)


// let arr = [10, 20, 30, 50, 235, 3000];
// // Выведите на экран только те числа из массива, которые начинаются на цифру 1, 2 или 5.

// for (let elem of arr) {
//     let value = elem.toString();
//     if (value[0] == '1' || value[0] == '2' || value[0] == '5') {
//         console.log(value);
//     }
// }

// Дан массив с числами. Выведите элементы этого массива в обратном порядке.

// let arr = [1, 23, 45, 5, 6, 67]

// for (let i = arr.length - 1; i >= 0; i--) {
//     console.log(arr[i])
// }

// Дан массив с числами. С помощью цикла выведите на экран все элементы, значение которых совпадает с их порядковым номером в массиве.

// let arr = [12, 23, 4, 5, 3, 2, 6, 7]

// for (let i = 0; i <= arr.length; i++) {
//     if (i == arr[i]) {
//         console.log(arr[i])
//     }
// }

// Дан массив с числами. С помощью цикла for и функции document.write выведите каждый элемент массива с новой строки. 
// Используйте для этого тег br.

// let arr = [10, 42, 56, 5, 6, 56, 5, 6]

// for (let elem of arr) {
//     document.write(elem)
//     document.write('<br>')
// }

// Составьте массив дней недели. С помощью цикла for выведите все дни недели, а выходные дни выведите жирным.

// let arr = ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье']

// for (let i = 0; i < arr.length; i++) {


//     if (arr[i] === 'Суббота' || arr[i] === 'Воскресенье') {
//         let weekends = arr[i]
//         document.write(`<strong>${weekends}<br>`)
//     } else {
//         document.write(arr[i]);
//         document.write('<br>');
//     }

// }


// Составьте массив дней недели. С помощью цикла for выведите все дни недели, а текущий день выведите курсивом. 
// Номер текущего дня должен храниться в переменной day.

// let week = ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье']
// let day = 4;

// for (let i = 0; i < week.length; i++) {
//     if (i === day - 1) {
//         let toDay = week[i]
//         document.write('<i>')
//         document.write(toDay)
//         document.write('</i>')
//     } else {
//         document.write(week[i])
//         document.write('<br>')
//     }
// }

// Дан следующий объект с работниками и их зарплатами:
// Увеличьте зарплату каждого работника на 10 %

// let obj = {
//     employee1: 100,
//     employee2: 200,
//     employee3: 300,
//     employee4: 400,
//     employee5: 500,
//     employee6: 600,
//     employee7: 700,
// };


// for (let key in obj) {
//     let value = obj[key]
//     value *= 1.1
//     console.log(Math.floor(value)) // остаток

// }

// Модифицируйте предыдущую задачу так, чтобы зарплата увеличивалась только тем работникам, у которых она меньше или равна 400.

// let obj = {
//     employee1: 100,
//     employee2: 200,
//     employee3: 300,
//     employee4: 400,
//     employee5: 500,
//     employee6: 600,
//     employee7: 700,
// };


// for (let key in obj) {
//     let value = obj[key]

//     if (value <= 400) {
//         value *= 1.1
//         console.log(Math.floor(value)) // остаток
//     }
// }


// let arr1 = [1, 2, 3, 4, 5];
// let arr2 = [6, 7, 8, 9, 10];

// // С помощью этих массивов создайте новый объект, сделав его ключами элементы первого массива, а значениями - элементы второго.

// let obj = {}

// for (i = 0; i < arr1.length; i++) {
//     obj[arr1[i]] = arr2[i]
// }

// console.log(obj)

// let obj = { 1: 6, 2: 7, 3: 8, 4: 9, 5: 10 };
// // Найдите сумму ключей этого объекта и поделите ее на сумму значений.
// let sum = 0
// let sum2 = 0


// for (let key in obj) {
//     let value = obj[key]
//     sum += Number(key)
//     sum2 += value

// }

// console.log(sum / sum2)


// let obj = { 'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5 };
// // Запишите ключи этого объекта в один массив, а значения - в другой.

// let arr1 = Object.keys(obj)
// let arr2 = Object.values(obj)

// console.log(arr1)
// console.log(arr2)

// let obj = {
//     1: 125,
//     2: 225,
//     3: 128,
//     4: 356,
//     5: 145,
//     6: 281,
//     7: 452,
// };

// let arr = []
//     // Запишите в новый массив элементы, значение которых начинается с цифры 1 или цифры 2. 
//     // То есть у вас в результате получится вот такой массив:

// for (let key in obj) {
//     let value = obj[key].toString()

//     if (value[0] === '1' || value[0] === '2') {
//         arr.push(value)
//         console.log('1')
//     }
// }

// console.log(arr)

// let arr = ['a', 'b', 'c', 'd', 'e'];
// // Создайте из этого массива следующий объект:

// // { 1: 'a', 2: 'b', 3: 'c', 4: 'd', 5: 'e' };

// let obj = {}

// for (let i = 0; i < arr.length; i++) {
//     obj[i + 1] = arr[i]
// }

// console.log(obj);

// let arr = ['a', 'b', 'c', 'd', 'e'];
// // Создайте из этого массива следующий объект:

// // { 'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5 };

// let obj = {}

// for (let i = 0; i < arr.length; i++) {
//     obj[arr[i]] = i + 1
// }

// console.log(obj)

// let arr = [
//     ['a', 'b', 'c'],
//     ['d', 'e', 'f'],
//     ['g', 'h', 'i'],
// ];

// console.log(arr[0][1])

// let arr = [
//     ['a', 'b', 'c'],
//     ['d', 'e', 'f'],
//     ['g', 'h', 'i'],
//     ['j', 'k', 'l'],
// ];
// // Выведите с его помощью элементы с текстом 'l', 'e', 'g' и 'a'.

// console.log(arr[3][2])
// console.log(arr[1][1])
// console.log(arr[2][0])
// console.log(arr[0][0])


// let arr = [
//     [1, 2],
//     [3, 4],
//     [5, 6]
// ];
// let sum = arr[0][0] + arr[0][1] + arr[1][0] + arr[1][1] + arr[2][0] + arr[2][1]


// console.log(sum)

// let arr = [
//     [
//         [1, 2],
//         [3, 4],
//     ],
//     [
//         [5, 6],
//         [7, 8],
//     ],
// ];

// let sum = arr[0][0][0] + arr[0][1][1] + arr[1][0][1] + arr[1][1][1]


// console.log(sum)


// let arr = [
//     [1, 2, 3, [4, 5, [6, 7]]],
//     [8, [9, 10]]
// ];

// let sum = (arr[0][0] + arr[0][1] + arr[0][2] + arr[0][3][0] + arr[0][3][1] + arr[0][3][2][0] + arr[0][3][2][1])

// console.log(sum)

// Перебор многомерных массивов в JavaScript



// let arr = [
//     [1, 2, 3, 4, 5],
//     [6, 7, 8],
//     [9, 10]
// ];

// let sum = 0

// for (let subArr of arr) {
//     for (let elem of subArr) {
//         console.log(elem);
//         console.log(subArr)
//         sum += elem
//     }
// }

// console.log(sum)



// let arr = [
//     [
//         [1, 2],
//         [3, 4]
//     ],
//     [
//         [5, 6],
//         [7, 8]
//     ]
// ];
// // С помощью вложенных циклов найдите сумму элементов этого массива.
// let sum = 0

// for (let subArr of arr) {
//     for (let subArrSec of subArr) {
//         for (let elem of subArrSec) {
//             sum += elem
//             console.log(elem)
//         }
//     }
// }

// console.log(sum)

// let arr = [[1, 2, 3, 4, 5], [6, 7, 8], [9, 10]];

// for (let i = 0; i < arr.length; i++) {
// 	for (let j = 0; j < arr[i].length; j++) {
// 		console.log(arr[i][j]);
// 	}
// }

// let arr = [
//     [1, 2, 3],
//     [4, 5],
//     [6]
// ];
// let sum = 0

// for (let i = 0; i < arr.length; i++) {
//     for (let j = 0; j < arr[i].length; j++) {
//         console.log(arr[i][j])
//         sum += arr[i][j]
//     }

// }

// console.log(sum)

// let arr = [
//     [
//         [1, 2],
//         [3, 4]
//     ],
//     [
//         [5, 6],
//         [7, 8]
//     ]
// ];
// let sum = 0


// for (let i = 0; i < arr.length; i++) {
//     for (let j = 0; j < arr[i].length; j++) {
//         for (let k = 0; k < arr[i][j].length; k++) {
//             sum += arr[i][j][k]
//         }
//     }

// }

// console.log(sum)

// [[1, 2, 3, 4, 5], [1, 2, 3, 4, 5], [1, 2, 3, 4, 5]]

// let arr = []

// for (let i = 0; i < 3; i++) {
//     arr[i] = []

//     for (let j = 0; j < 5; j++) {
//         arr[i].push(j + 1)
//     }
// }

// console.log(arr)

// [
// 	['x', 'x', 'x', 'x'],
// 	['x', 'x', 'x', 'x'],
// 	['x', 'x', 'x', 'x']
// ]

// let arr = []

// for (let i = 0; i < 3; i++) {
//     arr[i] = []
//     for (let j = 0; j < 4; j++) {
//         arr[i].push('x')
//     }
// }

// console.log(arr)

// [
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// ]

// let arr = []

// for (let i = 0; i < 3; i++) {
//     arr[i] = []
//     for (let j = 0; j < 2; j++) {
//         arr[i][j] = []
//         for (let k = 0; k < 5; k++) {
//             arr[i][j].push(k + 1)
//         }
//     }
// }
// console.log(arr)
// console.log(arr)

// let arr = [];

// for (let i = 0; i < 3; i++) {
//     arr[i] = []
//     for (let j = 1; j <= 5; j++) {
//         arr[i].push(j);
//     }
// }

// console.log(arr);

// let arr = [];

// for (let i = 0; i < 3; i++) {
//     arr[i] = [];

//     for (let j = 1; j <= 5; j++) {
//         arr[i].push(j);
//     }
// }

// console.log(arr);

// let arr = [];

// for (let i = 0; i < 3; i++) {
//     arr[i] = [];

//     for (let j = 1; j <= 5; j++) {
//         arr[i].push(j);
//     }
// }

// console.log(arr);


// [
//     [1, 2],
//     [3, 4],
//     [5, 6],
//     [7, 8]
// ]

// let arr = []


// for (let i = 0, k = 1; i < 4; i++) {
//     arr[i] = []
//     for (let j = 0; j < 2; j++) {
//         arr[i].push(k++)
//     }
// }

// console.log(arr)


// [[2, 4, 6], [8, 10, 12], [14, 16, 18], [20, 22, 24]]

// let arr = []

// for (let i = 0, k = 1; i < 4; i++) {
//     arr[i] = []
//     for (j = 0; j < 3; j++) {
//         if (k % 2 !== 0) {
//             k++
//         }
//         arr[i].push(k++)
//     }
// }

// console.log(arr)

// [[[1, 2], [3, 4]], [[5, 6], [7, 8]]]

// let arr = []

// for (let i = 0, k = 1; i < 4; i++) {
//     arr[i] = []
//     for (j = 0; j < 1; j++) {
//         arr[i][j] = []
//         for (let z = 0; z < 2; z++) {
//             arr[i][j].push(k++)
//         }
//     }
// }

// console.log(arr)


// let arr = [];
// let k = 1;

// for (let i = 0; i < 3; i++) {
//     arr[i] = [];

//     for (let j = 0; j < 3; j++) {
//         arr[i][j] = k;
//         k++;
//     }
// }

// console.log(arr);


// let obj = {
//     1: {
//         1: 11,
//         2: 12,
//         3: 13,
//     },
//     2: {
//         1: 21,
//         2: 22,
//         3: 23,
//     },
//     3: {
//         1: 24,
//         2: 25,
//         3: 26,
//     },
// }

// let sum = 0

// for (let key in obj) {
//     let subObj = obj[key]
//     for (let subKey in subObj) {
//         sum += subObj[subKey]
//     }
// }

// console.log(sum)

// let obj = {
//     1: {
//         1: {
//             1: 111,
//             2: 112,
//             3: 113,
//         },
//         2: {
//             1: 121,
//             2: 122,
//             3: 123,
//         },
//     },
//     2: {
//         1: {
//             1: 211,
//             2: 212,
//             3: 213,
//         },
//         2: {
//             1: 221,
//             2: 222,
//             3: 223,
//         },
//     },
//     3: {
//         1: {
//             1: 311,
//             2: 312,
//             3: 313,
//         },
//         2: {
//             1: 321,
//             2: 322,
//             3: 323,
//         },
//     },
// }

// let sum = 0

// for (let key in obj) {
//     let subObj = obj[key]
//     console.log(subObj)
//     for (let subKey in subObj) {
//         let subObjSec = subObj[subKey]
//         for (let subKeySec in subObjSec) {
//             sum += subObjSec[subKeySec]
//         }
//     }
// }

// console.log(sum)


// let days = {
//     'ru': ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'],
//     'en': ['mn', 'ts', 'wd', 'th', 'fr', 'st', 'sn'],
// };

// console.log(days['ru'][0]); // выведет 'пн'
// console.log(days['en'][2]); // выведет 'wd'

// let students = {
//     'group1': ['name11', 'name12', 'name13'],
//     'group2': ['name21', 'name22', 'name23'],
//     'group3': ['name31', 'name32', 'name33'],
// };

// console.log(students['group3'][0])

// let students = {
//     'group1': ['student11', 'student12', 'student13'],
//     'group2': ['student21', 'student22', 'student23'],
//     'group3': ['student31', 'student32'],
// };

// for (let group in students) {
//     for (let name of students[group])
//         console.log(name)
// }

// let data = {
//     1: [
//         'data11',
//         'data12',
//         'data13',
//     ],
//     2: [
//         'data21',
//         'data22',
//         'data23',
//     ],
//     3: [
//         'data31',
//         'data32',
//         'data33',
//     ],
//     4: [
//         'data41',
//         'data42',
//         'data43',
//     ],
// };

// for (let group in data) {
//     for (let string of data[group])
//         console.log(string)
// }


// let data = [{
//         1: 'data11',
//         2: 'data12',
//         3: 'data13',
//     },
//     {
//         1: 'data21',
//         2: 'data22',
//         3: 'data33',
//     },
//     {
//         1: 'data31',
//         2: 'data32',
//         3: 'data33',
//     },
// ];


// for (let groups in data) {
//     let group = data[groups]

//     for (let items in group) {
//         let names = group[items]
//         console.log(names)
//     }
// }

// let data = [{
//         1: [
//             'data111',
//             'data112',
//             'data113',
//         ],
//         2: [
//             'data121',
//             'data122',
//             'data123',
//         ],
//     },
//     {
//         1: [
//             'data211',
//             'data212',
//             'data213',
//         ],
//         2: [
//             'data221',
//             'data222',
//             'data223',
//         ],
//     },
//     {
//         1: [
//             'data411',
//             'data412',
//             'data413',
//         ],
//         2: [
//             'data421',
//             'data422',
//             'data423',
//         ],
//     },
// ];

// for (let group in data) {
//     let subGroup = data[group]

//     for (let items in subGroup) {
//         let names = subGroup[items]
//         console.log(names)
//     }
// }

// let employees = [{
//         name: 'name1',
//         salary: 300,
//     },
//     {
//         name: 'name2',
//         salary: 400,
//     },
//     {
//         name: 'name3',
//         salary: 500,
//     },
// ];

// for (let user of employees) {
//     console.log(user.name + ' - ' + user.salary)
// }


// let employees = [{
//         name: 'name1',
//         salary: 300,
//     },
//     {
//         name: 'name2',
//         salary: 400,
//     },
//     {
//         name: 'name3',
//         salary: 500,
//     },
// ];


// let sumSalary = 0

// for (let group of employees) {
//     sumSalary += group.salary
// }

// console.log(sumSalary)

// let employees = [{
//         name: 'name1',
//         salary: 300,
//         age: 28,
//     },
//     {
//         name: 'name2',
//         salary: 400,
//         age: 29,
//     },
//     {
//         name: 'name3',
//         salary: 500,
//         age: 30,
//     },
//     {
//         name: 'name4',
//         salary: 600,
//         age: 31,
//     },
//     {
//         name: 'name5',
//         salary: 700,
//         age: 32,
//     },
// ];

// for (let elem of employees) {
//     if (elem.age >= 30) {
//         console.log(`${elem.name} + ${elem.salary} + ${elem.age}`)
//     }
// }

// let months = {
//     'ru': [
//         'январь',
//         'февраль',
//         'март',
//         'апрель',
//         'май',
//         'июнь',
//         'июль',
//         'август',
//         'сентябрь',
//         'октябрь',
//         'ноябрь',
//         'декабрь',
//     ],
//     'en': [
//         'january',
//         'february',
//         'march',
//         'april',
//         'may',
//         'june',
//         'july',
//         'august',
//         'september',
//         'october',
//         'november',
//         'december',
//     ],
// };

// let lang = 'ru'; // может быть или 'ru' или 'en'
// let month = 5; // число от 0 до 11

// console.log(months[lang][month])

// let affairs = {
//     '2018': {
//         11: {
//             29: ['дело111', 'дело112', 'дело113'],
//             30: ['дело121', 'дело122', 'дело123'],
//         },
//         12: {
//             30: ['дело211', 'дело212', 'дело213'],
//             31: ['дело221', 'дело222', 'дело223'],
//         },
//     },
//     '2019': {
//         12: {
//             29: ['дело311', 'дело312', 'дело313'],
//             30: ['дело321', 'дело322', 'дело323'],
//             31: ['дело331', 'дело332', 'дело333'],
//         }
//     },
// }

// let yearFirst = '2018'
// let yearSecond = '2019'

// let month = 11


// console.log(affairs[yearFirst][month][29])

// Автор следующего кода хотел вывести элемент со значением '24':

//     let obj = {
//         key1: {
//             key2: '12',
//             key3: '13',
//         },
//         key2: {
//             key4: '24',
//             key5: '25',
//         },
//     }

// let key1 = 'key2';
// let key2 = 'key4';
// console.log(obj[key1][key2]);
// Код, однако, выводит не то, что ожидал автор.Исправьте ошибку.


// let obj = {
//     key1: {
//         key2: '12',
//         key3: '13',
//     },
//     key2: {
//         key4: '24',
//         key5: '25',
//     },
// }

// let key1 = 'key2';
// let key2 = 'key4';
// console.log(obj[key1][key2]);

// Код, однако, выводит не то, что ожидал автор. Исправьте ошибку.

// let obj = {
//     key1: {
//         key2: '12',
//         key3: '13',
//     },
//     key2: {
//         key4: '24',
//         key5: '25',
//     },
// }

// let key1 = 'key2';
// let key2 = 'key4'
// console.log(obj[key1][key2]);

// let employees = [{
//         name: 'name1',
//         salary: 300,
//         age: 28,
//     },
//     {
//         name: 'name2',
//         salary: 400,
//         age: 29,
//     },
//     {
//         name: 'name3',
//         salary: 500,
//         age: 30,
//     },
// ];

// employees.push({
//     name: 'name4',
//     salary: 4300,
//     age: 22,
// })

// console.log(employees)

// let affairs = {
//     '2019-12-28': ['data11', 'data12', 'data13'],
//     '2019-12-29': ['data21', 'data22', 'data23'],
//     '2019-12-30': ['data31', 'data32', 'data33'],
// }

// // Добавьте еще одно дело в дату '2019-12-29'.


// affairs['2019-12-31'] = ['data41', 'data42']
// console.log(affairs)



// let students = {
//     'group1': {
//         'subgroup11': ['student111', 'student112', 'student113'],
//         'subgroup12': ['student121', 'student122', 'student123'],
//     },
//     'group2': {
//         'subgroup21': ['student211', 'student212', 'student213'],
//         'subgroup22': ['student221', 'student222', 'student223'],
//     },
//     'group3': {
//         'subgroup31': ['student311', 'student312', 'student313'],
//         'subgroup32': ['student321', 'student322', 'student323'],
//     },
// };

// Добавьте нового студента в подгруппу 'subgroup11'


// students['group1']['subgroup11'].push('student114')
// console.log(students)


// Добавьте в первую группу еще одну подгруппу.


// students['group1']['subgroup13'] = []
// console.log(students)

// Сделайте четвертую группу, в ней сделайте подгруппу и добавьте в нее двух новых студентов.

// students.group4 = {}

// students['group4']['subgroup41'] = []

// students['group4']['subgroup41'].push('student421', 'student422')


// console.log(students)


// Возведите 2 в 10 степень.

// console.log(Math.pow(2, 10))

// // Найдите квадратный корень из 245.

// console.log(Math.sqrt(245))


// [4, 2, 5, 19, 13, 0, 10]
// Найдите квадратный корень из суммы кубов его элементов. Для решения воспользуйтесь циклом for.


// let arr = [4, 2, 5, 19, 13, 0, 10]
// let sum = 0

// for (let elem of arr) {


//     sum += elem
// }

// console.log(Math.sqrt(sum))

// Найдите квадратный корень из 379. Результат округлите до целых, до десятых, до сотых.

// let num = 379
// let sqrt = Math.sqrt(num)
// let fix = sqrt.toFixed(3)
// let round = Math.round(sqrt.fix)

// console.log(fix)

// Найдите квадратный корень из 587. 
// Округлите результат в большую и меньшую стороны, запишите результаты округления в объект с ключами 'floor' и 'ceil'.

// let num = 587

// let sqrt = Math.sqrt(num)

// let floor = Math.floor(sqrt)
// let ceil = Math.ceil(sqrt)

// console.log(floor)
// console.log(ceil)

// console.log(Math.max(4, -2, 5, 19, -130, 0, 10))


// function getRandomInt(min, max) {
//     return Math.floor(Math.random() * (max - min + 1)) + min;
// }

// console.log(getRandomInt(1, 100));


// С помощью цикла заполните массив 10-ю случайными целыми числами.

// let arr = []

// function getRandomInt(min, max) {
//     return Math.floor(Math.random() * (max - min + 1)) + min;
// }

// console.log(getRandomInt(1, 100));

// for (let i = 0; i <= 10; i++) {
//     arr.push(getRandomInt(1, 100))
// }
// console.log(arr)

// Даны переменные a и b.
// Найдите модуль разности a и b.Проверьте работу скрипта самостоятельно для различных a и b.


// let a = 1
// let b = 10

// console.log(Math.abs(a - b))

// Дана строка 'js'. Сделайте из нее строку 'JS'.

// let str = 'js'

// console.log(str.toUpperCase())
// console.log((str.toUpperCase()).toLowerCase())


// let str = 'abcde';
// let sub = str.substr(-5);

// console.log(sub);

// let str = 'abcde';
// let sub = str.substr(0, 4);

// console.log(sub);


// Дана строка 'я учу javascript!'. 
// Вырежьте из нее слово 'учу' и слово 'javascript' 
// тремя разными способами (через substr, substring, slice).

// let str = 'я учу javascript!'

// let subStr = str.substring(0, 2)

// console.log(subStr)

// Дана строка 'abcde'. Определите позицию буквы 'c' в этой строке.

// let str = 'abcde'
// let sub = str.lastIndexOf('c')

// console.log(sub) // 2

// Дана строка. Проверьте, есть ли в этой строке символ 'a'.

// let str = 'abcde'
// let sub = str.indexOf('a')

// console.log(sub)

// Дана строка. Проверьте, заканчивается ли эта строка на символ 'a'.

// let str = 'abcde'
// let sub = str.indexOf('a', 4)

// console.log(sub)

// Дана строка. Проверьте, начинается ли эта строка на 'http://'.

// let arr = 'http://'

// let sub = arr.indexOf('http://')

// console.log(sub)


// Дана строка. Проверьте, заканчивается ли эта строка на '.html'.

// let arr = '.html'

// let sub = arr.indexOf('.html')

// console.log(sub)

// let arr = 'http://'

// let sub = arr.startsWith('http://')
// let subEnd = arr.endsWith('http://')

// console.log(subEnd)

// Дана строка '1-2-3-4-5'. С помощью метода split запишите каждое число этой строки в отдельный элемент массива.

// let str = '1-2-3-4-5'
// let arr = str.split('-')

// console.log(arr)

// Дана строка '12345'. С помощью метода split запишите каждый символ этой строки в отдельный элемент массива.

// let str = '12345'
// let arr = str.split('')
// console.log(arr)

// let arr = [1, 2, 3, 4, 5]
// let str = arr.join('-')

// console.log(str)

// let arr = [1, 2, 3]
// let sub = arr.push(4, 5, 6)

// console.log(arr)

// let arr = [1, 2, 3]
// let sub = arr.unshift(4, 5, 6)

// console.log(arr)

// let arr = [1, 2, 3]
// let sub = arr.pop()

// console.log(sub)

// let arr = [1, 2, 3, 4, 5]

// let sub = arr.slice(0, 3)

// console.log(sub)

// let arr = [1, 2, 3, 4, 5]

// let sub = arr.slice(3)

// console.log(sub)

// let arr = [1, 2, 3, 4, 5]

// let sub = arr.splice(1, 2)

// console.log(arr)



// let arr = [1, 2, 3, 4, 5]

// let sub = arr.splice(1, 0, 'a', 'b', 'c')

// console.log(arr)

// [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e']

// let arr = [1, 2, 3, 4, 5]

// arr.splice(1, 0, 'a', 'b')
// arr.splice(6, 0, 'c')
// arr.splice(8, 0, 'e')

// console.log(arr)

// let arr = [1, 2, 3, 4, 5]

// console.log(arr.includes(3))
// arr.indexOf(3)

// console.log(arr.indexOf(3))


// Преобразуйте первые 2 буквы строки в верхний регистр.

// let str = 'london'

// let result = str.slice(0, 2).toUpperCase() + str.slice(1)

// console.log(result)


// let str = 'London'

// let result = str.slice(0, 1).toLowerCase() + str.slice(1)

// console.log(result)

// let str = 'word1 word2 word3';

// // Разобьем строку в массив слов:
// let words = str.split(' ');

// for (let i = 0; i < words.length; i++) {
//     // Увеличим регистр каждого слова:
//     words[i] = words[i].slice(0, 1).toUpperCase() + words[i].slice(1);
// }

// // Сольем массив обратно в строку:
// let result = words.join(' ');
// console.log(result); // выведет 'Word1 Word2 Word3'


// let str = 'word1 word2 word3'

// let words = str.split(' ')

// console.log(words)


// for (let i = 0; i < words.length; i++) {
//     words[i] = words[i].slice(0, 1).toUpperCase() + words[i].slice(1)
// }

// let result = words.join(' ')

// console.log(result)


// Преобразуйте строку 'var_test_text' в 'VarTestText'.

// let str = 'var_test_text'

// let word = str.split('_')

// console.log(word)

// for (let i = 0; i < word.length; i++) {
//     word[i] = word[i].slice(0, 1).toLowerCase() + word[i].slice(1)
// }

// let result = word.join('')

// console.log(result)

// let str = '12345';

// let result = str.split('').reverse().join('');

// console.log(result); // выведет '54321'


// Дана строка со словами. Напишите скрипт, который переставит слова в строке в обратном порядке.

// let str = 'sosite moy xyu'

// let result = str.split(' ').reverse().join(' ')

// console.log(result)

// let num = 12345
// let numStr = String(num)
// let arr = numStr.split('')

// console.log(arr)

// let sum = 0
// for (let digit of arr) {
//     sum += Number(digit)
// }

// console.log(sum)


// let num = 12345;
// let arr = String(num).split('');

// console.log(arr)

// let sum = 0;
// for (let digit of arr) {
//     sum += Number(digit);
// }

// console.log(sum);

// let num = 12345;
// let arr = String(num).split('');

// let prod = 1;
// for (let digit of arr) {
// 	prod *= digit;
// }

// console.log(prod);


/// FUNCTION 


// Сделайте функцию, выводящую в консоль ваше имя.

// function func() {
//     console.log('Danial')
// }

// func()

// function sum() {
//     let sum = 0
//     for (let i = 0; i < 100; i++) {
//         sum += i
//     }
//     console.log(sum)
// }
// sum()

// function func(num1, num2) {
//     console.log(num1 + num2)
// }

// func(1, 2)

// Сделайте функцию, которая параметрами принимает 3 
// числа и выводит в консоль сумму этих чисел.

// function func(num1, num2, num3) {
//     console.log(num1 + num2 + num3)
// }

// func(1, 2, 3)

// let param1 = 1;
// let param2 = 2;
// let param3 = 3;

// function func(num1, num2, num3) {
//     console.log(num1 + num2 + num3)
// }

// func(param1, param2, param3)

// function func(num) {
//     return num ** 2;
// }

// let res = func(3) + 1

// console.log(res)

// Сделайте функцию, 
// которая параметром принимает число, 
// а возвращает куб этого числа. 
// С помощью этой функции найдите куб числа 3 и 
// запишите его в переменную res.


// function func(num) {
//     return num ** 3
// }

// let res = func(3)

// console.log(res)


// Сделайте функцию, которая параметром принимает число, а возвращает квадратный корень из этого числа. 
// С помощью этой функции найдите корень числа 3, затем найдите корень числа 4. 
// Просуммируйте полученные результаты и выведите их в консоль.

// function func(num) {
//     return Math.sqrt(num)
// }

// let res = func(3) + func(4)

// console.log(res)

// function sqrt(num) {
//     return Math.sqrt(num);
// }

// function round(num) {
//     return num.toFixed(3);
// }


// let res = round(sqrt(2))
// console.log(res)

// function sqrt(num) {
//     return Math.sqrt(num);
// }

// function sum(num1, num2, num3) {
//     return num1 + num2 + num3;
// }

// function round(num) {
//     return num.toFixed(3);
// }

// let res = round(sum(sqrt(2), sqrt(3), sqrt(4)))
// console.log(res)

// function func() {
// 	let sum = 0;
// 	let i = 1;

// 	while (true) { // бесконечный цикл
// 		sum += i;

// 		if (sum >= 100) {
// 			return i; // цикл крутится пока не выйдет тут
// 		}

// 		i++;
// 	}
// }

// console.log( func() );

// Напишите функцию, которая параметром будет принимать число и делить его на 2 столько раз, пока результат не станет меньше 10. 
// Пусть функция возвращает количество итераций, которое потребовалось для достижения результата.

// function func(num) {
//     let i = 0
//     for (; num > 10; i++) {
//         num /= 2
//     }
//     return i;

// }

// console.log(func(420))

// function func(num1, num2) {

//     if (num1 > 0 && num2 > 0) {
//         return num1 * num2
//     } else {
//         return num1 - num2
//     }


// }

// console.log(func(2, 0));

// Сделайте функцию, которая параметром будет принимать массив с числами, 
// и проверять, что все элементы в этом массиве являются четными числами.


// function func(arr) {
//     let flag = false
//     for (let elem of arr) {
//         if (elem % 2 !== 0) {
//             flag = true
//         }
//     }

//     return flag
// }

// console.log(func([4, 4, 4, 4]))


// Сделайте функцию, которая параметром будет принимать число и проверять, что все цифры это числа являются нечетными.

// function func(num) {
//     let numStr = num.toString().split('')
//     let flag = true

//     for (let elem of numStr) {
//         if (Number(elem) % 2 == 0) {
//             flag = false
//         }
//     }

//     return flag

// }

// console.log(func(3321))

// Сделайте функцию, которая параметром будет принимать массив и проверять, есть ли в этом массиве два одинаковых элемента подряд.

// function func(arr) {
//     for (let i = 0; i < arr.length - 1; i++) {
//         if (arr[i] == arr[i + 1]) {
//             return true
//         }
//     }
//     return false
// }

// console.log(func([1, 1, 4, 4]))

// function func(arr) {
//     let previous = null

//     for (let i = 0; i < arr.length; i++) {
//         let current = arr[i]

//         if (current === previous) {
//             return true
//         }

//         previous = current
//     }

//     return false
// }

// console.log(func([2, 5, 3, 3]))

// function func(a, b) {
//     return a > b;
// }

// func(3, 2);

// function func(a, b) {

//     return a == b

// }

// console.log(func(1, 1))

// function func(a, b) {

//     return a != b

// }

// console.log(func(2, 2))

// function func(a, b) {

//     return a + b >= 10;
// }

// console.log(func(6, 4))

// function func(num) {

//     return num >= 0


// }

// console.log(func(-2))


// function calc(arr1, arr2) {
//     let res1 = 0;

//     for (let elem of arr1) {
//         res1 += elem;
//     }

//     let res2 = 0;

//     for (let elem of arr2) {
//         res2 += elem;
//     }

//     return res1 / res2;
// }

// console.log(calc([2, 2, 3, 4], [2, 4, 5, 6])) //  11 and 17

// function getSum(arr) {
//     let res = 0;

//     for (let elem of arr) {
//         res += elem;
//     }

//     return res;
// }
// console.log(getSum([1, 2, 5, 4, 5, 5]))

// function func1() {
//     return 3
// }

// function func2() {
//     return 5
// }

// console.log(func1() + func2());


// function sum(arr) {
//     let res = 0;

//     for (let elem of arr) {
//         res += elem;
//     }
//     return res;
// }

// console.log(sum([1, 2, 3, 4, 5]));

// let arr = [1, 2, 3, 4, 5];

// function func(arr) {
//     let res = 0;

//     for (let elem of arr) {
//         res += elem;
//     }
//     return res

// }

// console.log(func(arr))

// function func1() {
//     return 3;
// }

// function func2() {
//     return 5;
// }

// console.log(func1() + func2());

// let arr = [1, 2, 3, 4, 5]


// function sum(arr) {
//     let sum = 0

//     for (let elem of arr) {
//         sum += elem
//     }

//     return sum
// }

// console.log(sum(arr))

// let res = [1, 2, 3, 4, 5];


// function sum(arr) {
//     let sum = 0;

//     for (let elem of arr) {
//         sum += elem;
//     }
//     return sum
// }

// console.log(sum(res))

// function add(num) {
//     if (num <= 9) {
//         return num + '0';
//     } else {
//         return num
//     }
// }

// console.log(add(2))

// let arr = [1, 2, 3, 4, 5];
// let sum = getSum(arr);
// console.log(sum);

// function getSum(arr) {
//     let res = 0;

//     for (let elem of arr) {
//         res += elem;
//     }

//     return res;
// }


// let num = 12345;
// let res = getDigitsSum(num);
// console.log(res);

// function getDigitsSum(num) {
//     let arr = num.toString().split('');
//     let sum = 0;

//     for (let elem of arr) {
//         sum += Number(elem);
//     }

//     return sum;
// }

// console.log(isPrime(13)); // должен вывести true

// function isPrime(num) {
//     for (let i = 2; i < num; i++) {
//         if (num % i !== 0) {
//             return true;
//         } else {
//             return false;
//         }
//     }
// }

// Сделайте функцию, которая параметром будет принимать массив и возвращать сумму его элементов.

// let arr = [1, 2, 3, 4, 5]

// function sumArr(arr) {
//     let sum = 0
//     for (let elem of arr) {
//         sum += elem
//     }
//     return sum
// }

// console.log(sumArr(arr))

// Сделайте функцию, которая параметром будет принимать число и возвращать массив его делителей.

// function getDivisors(n) {
//     let divisors = []
//     for (let i = 1; i <= n; i++) {
//         if (n % i === 0) {
//             divisors.push(i);
//         }
//     }
//     return divisors;
// }

// const divisors = getDivisors(10);
// console.log(divisors);


// Сделайте функцию, которая параметром будет принимать строку и возвращать массив ее символов.

// let str = 'abcde'

// function getElemetString(str) {
//     return str.split('')

// }

// console.log(getElemetString(str))


// Сделайте функцию, которая параметром будет принимать строку и переворачивать ее символы в обратном порядке.

// let str = 'abcde'

// function strReverse(str) {
//     return str.split('').reverse().join('')
// }

// console.log(strReverse(str))

// Сделайте функцию, которая параметром будет принимать строку и делать заглавной первую букву этой строки.

// let str = 'abve'

// function firstUpperCase(str) {
//     return str.slice(0, 1).toUpperCase() + str.slice(1)
// }

// console.log(firstUpperCase(str))

// Сделайте функцию, которая параметром будет принимать строку и делать заглавной первую букву каждого слова этой строки.

// let str = 'sosi mou xyu'

// function firstWordUpperCase(str) {
//     let arr = str.split(' ')
//     for (let i = 0; i < arr.length; i++) {
//         arr[i] = arr[i].slice(0, 1).toUpperCase() + arr[i].slice(1);
//     }
//     let result = arr.join(' ');
//     return result
// }

// console.log(firstWordUpperCase(str))

// Сделайте функцию, заполняюю массив целыми числами от 1 до заданного.

// function createArray(n) {
//     let arr = []
//     for (let i = 1; i <= n; i++) {
//         arr.push(i)
//     }
//     return arr
// }

// let myArray = createArray(6)

// console.log(myArray)

// Сделайте функцию, которая будет возвращать случайный элемент из массива.

// let arr = [1, 2, 4, 5, 6, 5, 6, 7]

// function randomOfArray(arr) {
//     let random = Math.floor(Math.random() * arr.length)
//         // console.log(Math.floor(Math.random() * arr.length)) ?
//     return arr[random]
// }

// let myArr = randomOfArray(arr)
// console.log(myArr)


// Сделайте функцию, которая параметром будет принимать число и проверять, простое оно или нет.

// function primeNumb(num) {
//     if (num > 1) {
//         for (let i = 2; i < num; i++) {
//             if (num % i == 0) {
//                 return "Составное число"
//             }
//         }
//         return "Простое число"
//     } else {
//         return "Число должно быть больше 1"
//     }
// }

// console.log(primeNumb(4));


// Сделайте функцию, которая будет проверять пару чисел на дружественность.
// Дружественные числа - два числа, для которых сумма всех собственных
// делителей первого числа равна второму числу и наоборот,
// сумма всех собственных делителей второго числа равна первому числу. /// Zalupa

// Найдите все счастливые билеты. 
// Счастливый билет - это билет, в котором сумма первых трех цифр его номера равна сумме 
// вторых трех цифр его номера.



// const tickets = [111, 233, 234444, 4234, 111, 123, 123, 111111, 111111]

// function isHappyTicket(ticketNumber) {

//     const digits = ticketNumber.toString().split('')

//     if (digits.length !== 6) {
//         return false
//     }

//     const sum1 = digits[0] + digits[1] + digits[2]
//     const sum2 = digits[3] + digits[4] + digits[5]

//     return sum1 === sum2

// }

// const happyTickets = tickets.filter(isHappyTicket)
// console.log(happyTickets)


// Сделайте функцию, которая параметром будет принимать два числа и возвращать массив их общих делителей.

// function func(num1, num2) {
//     let min = Math.min(num1, num2)
//     let arr = []

//     for (let i = 0; i <= min; i++) {
//         if (num1 % i === 0 && num2 % i === 0) {
//             arr.push(i)
//         }
//     }
//     return arr
// }

// console.log(func(12, 18))


// Сделайте функцию, которая будет принимать строку на русском языке, а возвращать ее транслит.

// Сделайте функцию, которая будет принимать число, а возвращать это число прописью. 
// Пусть функция работает с числами до 999. Смотрите пример:

// func(123); // выведет 'сто двадцать три'


// function numberToText(num) {

//     let ones = ['', 'один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять']
//     let tens = ['', 'десять', 'двадцать', 'тридцать', 'сорок', 'пятьдесят', 'шестьдесят', 'семьдесят', 'восемьдесят', 'девяносто']
//     let teens = ['', 'одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать', 'шестнадцать', 'семнадцать', 'восемнадцать', 'девятнадцать']
//     let hundreds = ['', 'сто', 'двести', 'триста', 'четыреста', 'пятьсот', 'шестьсот', 'семьсот', 'восемьсот', 'девятьсот']


//     let result = ''

//     if (num > 99) {
//         result += hundreds[Math.floor(num / 100)] + ' '
//         num = num % 100;
//     }

//     if (num > 10 && num <= 19) {
//         result += teens[Math.floor(num / 11)] + ' '
//         num = num % 10
//     }

//     if (num > 9) {
//         result += tens[Math.floor(num / 10)] + ' '
//         num = num % 10
//     }


//     result += ones[num]


//     return result
// }

// console.log(numberToText(112))



// const hundredths = ['сто', 'двести', 'триста', 'четыреста', 'пятьсот', 'шестьсот', 'семьсот', 'восемьсот', 'девятьсот']
// const dozens = ['десять', 'двадцать', 'тридцать', 'сорок', 'пятьдесят', 'шестьдесят', 'семьдесят', 'восемьдесят', 'девяносто']
// const units = ['один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять']
// const teens = ['одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать', 'шестьнадцать', 'семьнадцать', 'восемьнадцать', 'девятнадцать']

// function convert(number) {
//     let words = []
//     let is_teens_used = false

//     const hundredth = Math.floor((number / 100) % 10)
//     const dozen = Math.floor((number / 10) % 10)
//     const unit = Math.floor((number / 1) % 10)

//     if (hundredth) {
//         words.push(hundredths[hundredth - 1])
//     }

//     if (dozen) {
//         if (dozen > 1) {
//             words.push(dozens[dozen - 1])
//         } else {
//             words.push(teens[unit - 1])
//             is_teens_used = true
//         }
//     }

//     if (!is_teens_used) {
//         words.push(units[unit - 1])
//     }

//     return words.join(' ')
// }

// const word_number = convert(112)
// console.log(word_number)


// function func(obj) {
//     obj.a = '!';
// }

// let obj = { a: 1, b: 2, c: 3 };
// func(obj);
// console.log(obj);

// function func(arr) {
// 	arr.splice(1, 1);
// }

// let arr = [1, 2, 3];
// func(arr);
// console.log(arr);

// function func(arr) {
//     let newArr = arr;
//     newArr[0] = '!';
// }

// let arr = [1, 2, 3];
// func(arr);
// console.log(arr);


// Сделайте функцию func, которая будет возвращать через return какую-либо строку.


// let func1 = function() {
//     return 1
// }

// let func2 = function() {
//     return 2
// }

// let result = func1() + func2()
// console.log(result)



// Сделайте массив arr с тремя функциями. 
// Пусть первая возвращает через return число 1, вторая - число 2, третья - число 3.

// let arr = [
//     function() { return 1 },
//     function() { return 2 },
//     function() { return 3 },
// ]

// let sum = arr[0]() + arr[1]() + arr[2]()

// console.log(sum)

// for (let func of arr) {
//     console.log(func())
// }

// let obj = {
// 	func1: function() {console.log(1)},
// 	func2: function() {console.log(2)},
// 	func3: function() {console.log(3)},
// };
// Воспользуемся нашим объектом:

// let obj = {
// 	func1: function() {console.log(1)},
// 	func2: function() {console.log(2)},
// 	func3: function() {console.log(3)},
// };

// obj.func1(); // выведет 1



// let obj = {
//     func1: function() { return 1 },
//     func2: function() { return 2 },
//     func3: function() { return 3 }
// }

// // let sum = obj.func1() + obj.func2() + obj.func3()
// // console.log(sum)

// for (let func in obj) {
//     let funct = obj[func]
//     console.log(funct())
// }


// Сделайте объект с тремя функциями, каждая из которых будет принимать параметром массив с числами. 
// Сделайте так, чтобы первая функция возвращала сумму элементов массива, вторая функция - сумму квадратов, а третья - сумму кубов.

// let obj = {
//     func1: function(arr) { let result = 0; for (let elem of arr) { result += elem } return result },
//     func2: function(sumSquare) { let result = 0; for (let elem of arr) { result += elem * elem } return result },
//     func3: function(sumCube) { let result = 0; for (let elem of arr) { result += elem * elem * elem } return result }
// }

// let arr = [1, 2, 3, 4, 5]

// console.log(obj.func3(arr))

// Сделайте функцию test, параметрами принимающую 3 функции. Передайте в нее первым параметром функцию, 
// возвращающую 1, вторым - функцию, возвращающую 2, третьим - функцию, возвращающую 3. 
// Выведите в консоль сумму результатов функций.

// test(
//     function() { return 1; },
//     function() { return 2; },
//     function() { return 3; }
// );

// function test(func1, func2, func3) {
//     let res = func1() + func2() + func3()
//     console.log(res)
// }


// Сделайте функцию test, параметрами принимающую 3 функции и возвращающую сумму результатов переданных функций.

// function get1() {
//     return 1
// }

// function get2() {
//     return 2
// }

// function get3() {
//     return 3
// }


// function test(func1, func2, func3) {
//     console.log(func1() + func2() + func3())
// }

// test(func1, func2, func3);


// Сделайте 3 функции, объявив их как Function Declaration и дав им имена func1, func2 и func3. 
// Пусть первая функция возвращает 1, вторая - 2, а третья - 3. 
// Передайте эти функции параметром в функцию test из предыдущей задачи.

// let func1 = function() {
//     return 1
// }

// let func2 = function() {
//     return 2
// }

// let func3 = function() {
//     return 3
// }

// function test(func1, func2, func3) {
//     console.log(func1() + func2() + func3())
// }

// test(func1, func2, func3);






// test(function(num) {
//     return num * num;
// });

// function test(func) {
//     console.log(func(3));
// }

// function func(num) {
//     return num * num * num
// }

// function SumFunc(num1, num2) {
//     let resut = 0
//     let numFirst = num1 * num1 * num1
//     let numSec = num2 * num2 * num2
//     resut += numFirst + numSec
//     return resut
// }

// console.log(SumFunc(1, 2))

// Скопируйте код моей функции test. 
// Вызовите эту функцию, передав ей параметром анонимную функцию, которая параметром 
// будет принимать число и возвращать его куб.

// Переделайте передаваемую функцию на Function Expression с тем же именем func.

// Пусть передаваемая функция теперь принимает два параметра и возвращает их сумму. 
// При вызове передаваемой функции внутри test передайте в передаваемую функцию число 2 и число 3. 
// Выведите алертом результат.

// function test(arr, func) {
//     for (let i = 0; i < arr.length; i++) {
//         arr[i] = func(arr[i])
//     }
//     return arr
// }

// let result = test([1, 5, 3], function(num) {
//     return num * num // * num
// })

// console.log(result)

// Сделайте функцию func, которая параметрами будет принимать два числа, а возвращать сумму квадрата первого числа с кубом второго числа. 
// Сделайте для этого вспомогательную функцию square, возводящую число в квадрат, и вспомогательную функцию cube, возводящую число в куб.

// function sumSquareCube(num1, num2) {
//     let result = 0

//     function square(num1) {
//         return num1 * num1
//     }

//     function cube(num2) {
//         return num2 * num2 * num2
//     }

//     result += square(num1) + cube(num2)
//     return result
// }

// console.log(sumSquareCube(4, 2))
// let num = 1;

// function test() {
//     // let num = 1;

//     function func() {
//         console.log(num);
//     }

//     func();
// }

// test();


// function test(num1, num2) {
// 	function func() {
// 		console.log(num1 + num2);
// 	}

// 	func();
// }

// test(1, 2);


// function test(num) {
// 	function func(localNum) {
// 		console.log(localNum);
// 	}

// 	func(num);
// }

// test(1);


// function test(num) {
//     function func(localNum) {
//         num = 2;
//     }

//     func(num);
//     console.log(num);
// }

// test(1);


/// function callback 


// function each(arr, callback) {
//     let result = [];

//     for (let elem of arr) {
//         result.push(callback(elem)); // вызываем функцию-коллбэк
//     }

//     return result;
// }

// let result = each([1, 2, 3, 4, 5], function(num) {
//     return num ** 2;
// });

// console.log(result);


// Дан массив с числами. С помощью созданной нами функции each увеличьте каждый элемент в два раза.


// Дан массив со строками. С помощью созданной нами функции each переверните символы каждой строки в обратном порядке.


// function each(arr, callback) {
//     let result = [];

//     for (let elem of arr) {
//         result.push(callback(elem)); // вызываем функцию-коллбэк
//     }

//     return result;
// }

// let result = each(['zalupa', 'suka'], function(str) {
//     let strSec = str.split('').reverse()
//     let strS = strSec.join('')
//     return strS
// })

// console.log(result)

// Дан массив со строками. С помощью созданной нами функции each сделайте заглавным первый символ каждой строки.

// function each(arr, callback) {
//     let result = [];

//     for (let elem of arr) {
//         result.push(callback(elem)); // вызываем функцию-коллбэк
//     }

//     return result;
// }

// function capitalizeFirstLetter(str) {
//     return str.slice(0, 1).toUpperCase() + str.slice(1);
// }


// let result = each(['zalupa'], capitalizeFirstLetter);

// console.log(result)



////////////////////


// function each(arr, callback) {
//     let result = [];

//     for (let elem of arr) {
//         result.push(callback(elem)); // вызываем функцию-коллбэк
//     }

//     return result;
// }

// function cube(num) {
//     return num ** 3;
// }


// let result = each([1, 23, 4, 5], cube)
// console.log(result)



// let func2 = (num1, num2) => {
//     let result = num1 * num2;
//     return result;
// }

// console.log(func2(4, 4))


// let result = every([1, 2, 3, 4, 5], function(elem) {
//     if (elem > 0) {
//         return true;
//     } else {
//         return false;
//     }
// });


// // let result = every([1, 2, 3, 4, 5], elem => elem > 0)

// function each(arr, callback) {
//     let result = [];

//     for (let elem of arr) {
//         result.push(callback(elem)); // вызываем функцию-коллбэк
//     }

//     return result;
// }

// let result = every([1, 2, 3, 4, 5], elem => elem % 2 == 0);

// console.log(result)

// let result = every([1, 2, 3, 4, 5], (elem, index) => elem * index < 10)

// console.log(result)




// let arr = [
//     [1, 2, 50],
//     [4, 5, 6],
//     [7, 8, 9]
// ];

// let result = each(arr, (elem, index) => elem * index > 10)


// console.log(result)

// Работа с рекурсией в JavaScript

// let i = 1;

// function func() {
//     console.log(i);
//     i++;

//     if (i <= 10) {
//         func(); // здесь функция вызывает сама себя
//     }
// }
// func();


// function func(arr) {
//     console.log(arr.shift(), arr);

//     if (arr.length != 0) {
//         func(arr);
//     }
// }

// func([1, 2, 3]);


// function func(arr) {
//     console.log(arr.shift(), arr)

//     if (arr.length != 0) {
//         func(arr)
//     }
// }

// let arr = [1, 2, 3, 4, 5];

// func(arr)


// function getSum(arr) {
// 	let sum = arr.shift();

// 	if (arr.length !== 0) {
// 		sum += getSum(arr);
// 	}

// 	return sum;
// }

// console.log(getSum([1, 2, 3]));






// function getSum(arr) {
//     let sum = arr.shift()

//     if (arr.length !== 0) {
//         sum += getSum(arr)
//     }
//     return sum
// }

// let arr = [1, 2, 3, 4, 5];

// console.log(getSum(arr))


// Рекурсия и многомерные структуры в JavaScript





// function func(arr) {
//     for (let elem of arr) {
//         if (typeof elem == 'object') {
//             // элемент - массив
//         } else {
//             // элемент - примитив
//             console.log(elem);
//         }
//     }
// }

// func([1, [2, 7, 8],
//     [3, 4, [5, [6, 7]]]
// ]);


// function func(arr) {
//     for (let elem of arr) {
//         if (typeof elem == 'object') {
//             func(elem);
//         } else {
//             console.log(elem);
//         }
//     }
// }

// func([1, [2, 7, 8],
//     [3, 4, [5, [6, 7]]]
// ]);


// function printPrimitiveValues(obj) {
//     for (let key in obj) {
//         if (obj.hasOwnProperty(key)) {
//             let value = obj[key];
//             if (typeof value === 'object') {
//                 printPrimitiveValues(value);
//             } else {
//                 console.log(value);
//             }
//         }
//     }
// }

// const obj = { a: 1, b: { c: 2, d: 3, e: 4 }, f: { g: 5, j: 6, k: { l: 7, m: { n: 8, o: 9 } } } }

// printPrimitiveValues(obj)



// Дан многомерный массив произвольного уровня вложенности, например, такой:

// [1, [2, 7, 8], [3, 4, [5, [6, 7]]]]
// Напишите код, который развернет наш многомерный массив в одномерный. Для приведенного выше массива это будет выглядеть вот так:

// [1, 2, 7, 8, 3, 4, 5, 6, 7]


// let arr = [1, [2, 7, 8],
//     [3, 4, [5, [6, 7]]]
// ]

// function flattenArray(arr, result = []) {
//     for (const value of arr) {
//         if (Array.isArray(value)) {

//             flattenArray(value, result)
//         } else {
//             result.push(value)
//         }
//     }
//     return result
// }

// let result = flattenArray(arr)

// console.log(result)

// function func(arr) {
//     let sum = 0;

//     for (let elem of arr) {
//         if (typeof elem == 'object') {
//             sum += func(elem);
//         } else {
//             sum += elem;
//         }
//     }

//     return sum;
// }

// console.log(func([1, [2, 7, 8],
//     [3, 4, [5, [6, 7]]]
// ]));






// function sumObjectValues(obj) {
//     let sum = 0

//     for (let key in obj) {
//         if (obj.hasOwnProperty(key)) {
//             let value = obj[key]
//             if (typeof value === 'object') {

//                 sum += sumObjectValues(value)
//             } else if (typeof value === 'number') {
//                 sum += value

//             }
//         }
//     }
//     return sum
// }

// const obj = { a: 1, b: { c: 2, d: 3, e: 4 }, f: { g: 5, j: 6, k: { l: 7, m: { n: 8, o: 9 } } } }

// console.log(sumObjectValues(obj))


// Дан многомерный массив произвольного уровня вложенности, содержащий внутри себя строки, например, такой:

// ['a', ['b', 'c', 'd'], ['e', 'f', ['g', ['j', 'k']]]]
// С помощью рекурсии слейте элементы этого массива в одну строку:

// 'abcdefgjk'

// function objectInString(arr) {
//     let result = ''
//     for (const value of arr) {
//         if (Array.isArray(value)) {
//             result += objectInString(value)
//         } else if (typeof value === 'string') {
//             result += value
//         }

//     }
//     return result
// }

// const arr = ['a', ['b', 'c', 'd'],
//     ['e', 'f', ['g', ['j', 'k']]]
// ]
// const result = objectInString(arr)

// console.log(result) // 'abcdefgjk'


// function func(arr) {
// 	for (let i = 0; i < arr.length; i++) {
// 		if (typeof arr[i] == 'object') {
// 			arr[i] = func(arr[i]);
// 		} else {
// 			arr[i] = arr[i] + '!';
// 		}
// 	}

// 	return arr;
// }

// console.log(func([1, [2, 7, 8], [3, 4, [5, 6]]]));


// const arr = [1, [2, 7, 8],
//     [3, 4],
//     [5, [6, 7]]
// ]

// function getElementsSquare(arr) {
//     for (let i = 0; i < arr.length; i++) {
//         if (typeof arr[i] == 'object') {
//             arr[i] = getElementsSquare(arr[i])
//         } else {
//             arr[i] = arr[i] * arr[i]
//         }
//     }
//     return arr;
// }

// const result = getElementsSquare(arr)

// console.log(result)


// let arr = [1, 2, 3, 4, 5];

// let result = arr.map(function(elem) {
// 	console.log(elem); // последовательно выведет 1, 2, 3, 4, 5
// });

// Дан массив с числами.
// Используя метод map извлеките из каждого элемента массива квадратный корень и запишите результат в новый массив.


// let arr = [1, 2, 3, 4, 5]

// let result = arr.map(function(elem) {

//     return Math.sqrt(elem);

// })

// console.log(result)

// Дан массив со строками. Используя метод map в конец значению каждого элемента массива добавьте символ '!'.

// let arr = ['123', '123', 'asdw']

// let result = arr.map(function(elem) {

//     return elem + '!';

// })

// console.log(result)

// Дан массив со строками. Используя метод map переверните символы каждой строки в обратном порядке.
// let arr = ['123', '123', 'asdw']

// const result = arr.map(str => str.split('').reverse().join(''))

// console.log(result)

// let arr = ['123', '456', '789'];
// Используя метод map преобразуйте этот массив в следующий:

// let arr = [
// 	[1, 2, 3],
// 	[4, 5, 6],
// 	[7, 8, 9]
// ];


// let arr = ['123', '456', '789'];
// let result = arr.map(str => str.split('').map(st => parseInt(st, 10)));

// console.log(result)


// let arr = ['a', 'b', 'c', 'd', 'e'];

// let result = arr.map(function(elem, index) {
//     return elem + index;
// });

// console.log(result); // выведет ['a0', 'b1', 'c2', 'd3', 'e4']

// Дан массив с числами.
// Используя метод map запишите в каждый элемент массива значение этого элемента,
// умноженное на его порядковый номер в массиве.


// let arr = [1, 2, 4, 5, 6, 7, 4]

// let result = arr.map((elem, index) => elem * index)

// console.log(result)


// Метод forEach для перебора массива в JavaScript

// let arr = ['a', 'b', 'c', 'd', 'e'];

// arr.forEach(function(elem, index) {
//     document.write(index + '. ' + elem + '<br>');
// });

// let arr = [1, 2, 3, 4, 5];
// let sum = 0;

// arr.forEach(function(elem, index) {
//     sum += elem;
//     console.log(index)
// });

// console.log(sum);


// Дан массив с числами. Используя метод forEach найдите сумму квадратов элементов этого массива.

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
// let sum = 0

// arr.forEach(function(elem) {
//     sum += elem * elem
// })

// console.log(sum)


// Метод filter для фильтрации массива в JavaScript

// let arr = [1, 2, 3, 4, 5]

// // let result = arr.filter(function(elem) {
// //     if (elem % 2 != 0) {
// //         return true;
// //     } else {
// //         return false;
// //     }
// // });


// let result = arr.filter((elem) => elem % 2 == 0);
// console.log(result); // выведет [2, 4]


// Дан массив с числами. Оставьте в нем только положительные числа.

// let arr = [1, 2, 3, 4, 5, -4, -3, -2]

// let result = arr.filter(elem => elem > 0)

// console.log(result)

// Дан массив с числами. Оставьте в нем только отрицательные числа.


// let arr = [1, 2, 3, 4, 5, -4, -3, -2]

// let result = arr.filter(elem => elem < 0)

// console.log(result)

// Дан массив с числами. Оставьте в нем только числа, которые больше нуля, но меньше 10.

// let arr = [1, 2, 3, 4, 5, -4, -3, -2, 12]

// console.log(arr.filter(elem => elem > 0 && elem < 10))


// Дан массив со строками. Оставьте в нем только те строки, длина которых больше 5-ти символов.

// let arr = ['qwert', 'qwertyu', 'qwerty']

// let result = arr.filter(elem => elem.length > 5)

// console.log(result)

// Дан массив с числами. Оставьте в нем только те числа, произведение которых на их порядковый номер меньше 30.
// let arr = [1, 2, 3, 4, 5, -4, -3, -2, 12]

// let result = arr.filter((elem, index) => elem * index < 30)

// console.log(result)


// Дан массив, в нем могут быть обычные элементы и подмассивы, например [1, 2, [3, 4], 5, [6, 7]]. Оставьте в нем только обычные элементы.

// function isNotArray(elem) {
//     return !Array.isArray(elem)
// }

// let arr = [1, 2, [3, 4], 5, [6, 7]]
// let filteredArray = arr.filter(isNotArray)

// console.log(filteredArray)


// let arr = [1, 2, 3, 4, 5];

// let filtered = arr.filter(elem => elem % 2 == 0);
// console.log( filtered.length ); // выведет 2


// let arr = [1, 2, 3, 4, 5];
// console.log( arr.filter(elem => elem % 2 == 0).length );

// Дан массив с числами. Посчитайте количество отрицательных чисел в этом массиве.

// let arr = [1, 2, 4, 5, 6, -2, -3, 5, -5]

// let filtered = arr.filter(elem => elem < 0).length

// console.log(filtered)

// Метод every с массивом

// let arr = [2, 4, 6, 8];

// let result = arr.every(elem => elem % 2 == 0);
// console.log(result);

// Дан массив с числами. Проверьте то, что все элементы в массиве больше нуля.

// let arr = [2, 4, 6, 8, 0]

// let result = arr.every(elem => elem > 0)
// console.log(result)

// Дан массив с числами. Проверьте то, что для всех элементов произведение их значений на их порядковый номер меньше 30.

// let arr = [2, 4, 6, 8, 23]

// let result = arr.every((elem, index) => elem * index < 30)

// console.log(result)

// Метод some для проверки массива в JavaScript
// let arr = [2, 4, 6, 8];

// let result = arr.some(elem => elem % 2 == 0);
// console.log(result);

// Дан массив с числами. Проверьте то, что в массиве есть хотя бы одно число больше нуля.

// let arr = [2, 4, 6, 8];

// console.log(arr.some(elem => elem > 0))


// Дан массив с числами. Проверьте то, что хотя бы для одного элемента произведение его значения на порядковый номер больше 30.

// let arr = [2, 4, 6, 8, 23]

// let result = arr.some((elem, index) => elem * index > 30)

// console.log(result)

// Оператор spread в JavaScript

// function func(num1, num2, num3) {
//     return num1 + num2 + num3;
// }

// // let arr = [1, 2, 3];

// // let arr = [1, 2, 3];
// // func(arr);

// // let arr = [1, 2, 3];
// // func(arr[0], arr[1], arr[2]);


// let arr = [1, 2, 3];
// console.log(func(...arr));


// function func(num1, num2, num3, num4, num5) {
//     return num1 + num2 + num3 + num4 + num5;
// }

// let arr = [1, 2, 3, 4, 5];

// console.log(func(...arr))


// function func(num1, num2, num3, num4, num5) {
//     return num1 + num2 + num3 + num4 + num5;
// }

// // // console.log(func(...[1, 2], ...[3, 4, 5]))
// // console.log(func(1, 2, ...[3, 4, 5]))
// console.log(func(1, ...[2, 3, 4], 5))


// function func(n1, n2, n3, n4, n5, n6, n7, n8) {
//     return (n1 + n2 + n3 + n4) * (n5 + n6 + n7 + n8);
// }

// console.log(func(1, ...[2, 3, 4], 5, ...[6], ...[7, 8]));


// let arr = [1, 2, 3, 4, 5, 3, 4, 6, 8, 0, 8, 76, 2, `1`]
// let max = Math.max(...arr);

// console.log(max)

// Дан массив с числами. Используя Math.min и spread выведите на экран минимальное значение массива.

// let arr = [1, 2, 3, 4, 5, 3, 4, 6, 8, 0, 8, 76, 2, `1`]
// let max = Math.min(...arr);

// console.log(max)

// let arr1 = [1, 2, 3];
// let arr2 = [...arr1];

// console.log(arr2);

// Оператор spread для строк и чисел в JavaScript

// ...'abcde'; // разобьет строку в символы через запятую: 'a','b','c','d','e'


// function func(s1, s2, s3, s4, s5) {
//     return s1 + '-' + s2 + '-' + s3 + '-' + s4 + '-' + s5;
// }

// console.log(func(...
//     'asdfg'))


// Оператор rest в JavaScript
// function func(a, b) {
// 	console.log(a);
// 	console.log(b);
// }

// func(1, 2, 3, 4, 5);

// function func(a, b, ...rest) {
// 	console.log(a);    // выведет 1
// 	console.log(b);    // выведет 2
// 	console.log(rest); // выведет [3, 4, 5]
// }

// func(1, 2);

// function func(a, b, ...rest) {
// 	console.log(a);    // выведет 1
// 	console.log(b);    // выведет 2
// 	console.log(rest); // выведет []



// function func(...nums) {
//     let sum = 0;

//     for (let num of nums) {
//         sum += num;
//     }

//     return sum;
// }

// let result = func(1, 2, 3);
// console.log(result); // выведет 6


// Напишите функцию, которая будет принимать параметрами произвольное количество чисел и возвращать их среднее арифметическое.


// function arithmeticMean(...nums) {
//     let sumElem = 0
//     let sumIndex = 0
//     let result = nums.map(function sumArithmetic(elem, index) {
//         sumElem += elem
//         sumIndex += index
//     })
//     console.log(sumElem)
//     console.log(sumIndex)
//     return sumElem % sumIndex
// }

// console.log(arithmeticMean(1, 2, 4, 5, 6, 8, 9, 0))

// let result = unite([1, 2, 3], [4, 5, 6], [7, 8, 9]);
// console.log(result); // выведет [ [1, 2, 3,] [4, 5, 6], [7, 8, 9] ]


// function unite(...arrs) {
// 	return arrs;
// }

// let result = merge([1, 2, 3], [4, 5, 6], [7, 8, 9]);
// console.log(result); // выведет [1, 2, 3, 4, 5, 6, 7, 8, 9]


// merge([1, 2, 3], [4, 5, 6], [7, 8, 9]);

// function merge(...arrs) {
//     console.log(arrs); // выведет  [ [1, 2, 3,] [4, 5, 6], [7, 8, 9] ]
// }

// let arrs = [
//     [1, 2, 3, ][4, 5, 6],
//     [7, 8, 9]
// ];

// let result = [].concat(...arrs);
// console.log(result); // выведет [1, 2, 3, 4, 5, 6, 7, 8, 9]

// function merge(...arrs) {
//     return [].concat(...arrs);
// }

// let result = merge([1, 2, 3], [4, 5, 6], [7, 8, 9]);
// console.log(result); // выведет [1, 2, 3, 4, 5, 6, 7, 8, 9]


// let arrs = [
//     [1, 2, 3],
//     [4, 5, 6],
//     [7, 8, 9]
// ];

// let result = [].concat(...arrs);
// console.log(result); // выведет [1, 2, 3, 4, 5, 6, 7, 8, 9]



// let arr = [2025, 12, 31];
// let [year, month, day] = arr;

// let arr = ['John', 'Smit', 'development', 'programmer', 2000];

// let [name, surname, department, position, salary] = arr

// console.log(name, surname)

// function func() {
//     return ['John', 'Smit', 'development', 'programmer', 2000];
// }



// let [name, surname, department, position, salary] = func()

// console.log(name)


// let arr = ['John', 'Smit', 'development', 'programmer', 2000];

// // let department = arr[2];
// // let position   = arr[3];

// let [, , department, position] = arr

// console.log(department)

// let arr = ['John', 'Smit', 'development', 'programmer', 2000];

// // let name = arr[0];
// // let surname = arr[1];

// // let info = arr.slice(2); // все элементы со второго до конца массива

// let [name, surname, ...info] = arr

// console.log(name)

// let arr = ['John', 'Smit', 'development', 'programmer'];

// let name       = arr[0];
// let surname    = arr[1];
// let department = arr[2];

// let position;
// if (arr[3] !== undefined) {
// 	position = arr[3];
// } else {
// 	position = 'trainee';
// }

// let [name, surname, department, position = 'trainee', ] = arr

// console.log(position)

// function defaultDay() {
//     return (new Date).getDate();
// }

// function defaultMonth() {
//     return (new Date).getMonth();
// }

// function defaultYear() {
//     return (new Date).getFullYear();
// }

// let arr = []
// let [year = defaultYear(), month = defaultMonth(), day = defaultDay()] = arr;

// console.log(year, month, day)

// let options = {
//     color: 'red',
//     width: 400,
//     height: 500,
// };

// let { color, width, height } = options

// console.log(color)

// let obj = {
// 	year:  2025,
// 	month: 12,
// 	day:   31,
// };

// let {year: y, month: m, day: d} = obj;

// console.log(y); // выведет 2025
// console.log(m); // выведет 12
// console.log(d); // выведет 31


// let options = {
//     width: 400,
//     height: 500
// };

// // let с;
// // if (options.с !== undefined) {
// //     с = options.color;
// // } else {
// //     с = 'black';
// // }

// // let w = options.width;
// // let h = options.height;

// let { width: w, height: h, color: c = 'black' } = options

// console.log(c)


// function func([name, surname, department, position, salary]) {
//     console.log(name)
// }

// func(['John', 'Smit', 'development', 'programmer', 2000]);


// function func([name, surname, info, ...rest]) {
//     console.log(info)
// }

// func(['John', 'Smit', 'development', 'programmer', 2000]);

// function func([name, surname, department, position = 'джиниур']) {
//     //     let name = employee[0];
//     //     let surname = employee[1];
//     //     let department = employee[2];

//     //     let position;
//     //     if (arr[3] !== undefined) {
//     //         position = arr[3];
//     //     } else {
//     //         position = 'джуниор';
//     //     }
//     console.log(name)
// }

// func(['John', 'Smit', 'development']);

// function func(department, [name, surname], [year, month, day]) {
//     // let name = employee[0];
//     // let surname = employee[1];

//     // let year = hired[0];
//     // let month = hired[1];
//     // let day = hired[2];

//     console.log(year)
// }

// func('development', ['John', 'Smit'], [2018, 12, 31]);


// function func({ color, width, height }) {
//     console.log(color)
// }

// func({ color: 'red', width: 400, height: 500 });


// function func({ color = 'black', width, height }) {
//     // let width = options.width;
//     // let height = options.height;

//     // let color;
//     // if (options.color !== undefined) {
//     //     color = options.color;
//     // } else {
//     //     color = 'black';
//     // }

//     console.log(color)
// }

// func({ color: 'red', width: 400, height: 500 });


// let date = new Date()

// console.log(date)

// let date = new Date();

// console.log(date.getFullYear()); // год
// console.log(date.getMonth()); // месяц
// console.log(date.getDate()); // день

// console.log(date.getHours()); // часы
// console.log(date.getMinutes()); // минуты
// console.log(date.getSeconds()); // секунды

// let date = new Date();
// console.log(date.getFullYear() + '-' + (date.getMonth() + 1) + '-' + date.getDate());

// function addZero(num) {
//     if (num >= 0 && num <= 9) {
//         return '0' + num
//     } else {
//         return num
//     }
// }
// console.log(
//     addZero(date.getFullYear()) + '-' +
//     addZero(date.getMonth() + 1) + '-' +
//     addZero(date.getDate())
// );


// Выведите на экран текущую дату-время в формате 12:59:59 31.12.2014. 
// Используйте для всех частей даты (кроме года) созданную нами функцию для добавления нуля при необходимости.

// let date = new Date();

// function addZero(num) {
//     if (num >= 0 && num <= 9) {
//         return '0' + num
//     } else {
//         return num
//     }
// }

// console.log(
//     addZero(date.getHours()) + ':' +
//     addZero(date.getMinutes()) + ':' +
//     addZero(date.getSeconds()) + ' ' +
//     addZero(date.getFullYear()) + '.' +
//     addZero(date.getMonth() + 1) + '.' +
//     addZero(date.getDate())
// );

// Дана дата в формате год-месяц-день. Преобразуйте эту дату в формат день.месяц.год.

// let num = '2012-12-12'
// let res = num.split('-').reverse().join('.')

// console.log(res)


// let date = new Date();
// console.log(date.getDay());

// function isWeekend(date) {
//     if (date == 7 && date == 0) {
//         return 'Выходной'
//     } else {
//         return 'Будний день'
//     }
// }


// console.log(isWeekend(date))

// Определите сколько дней осталось до ближайшего воскресенья.

// let date = new Date()
// let dateWeek = date.getDay()

// let res = function howDaystoWeekend(dateWeek) {
//     let weekends = 8
//     return weekends - dateWeek
// }

// console.log(res(dateWeek))

// function daysUntilSunday() {
//     let date = new Date()
//     let today = date.getDay()
//     let daysUntilSunday = 7 - today
//     return daysUntilSunday
// }

// console.log(daysUntilSunday())


// let date = new Date();
// let day = date.getDay();
// let month = date.getMonth();

// let days = ['вс', 'пн', 'вт', 'ср', 'чт', 'пт', 'сб'];
// let months = [
//     'янв', 'фев', 'мар', 'апр', 'май', 'июн',
//     'июл', 'авг', 'сен', 'окт', 'ноя', 'дек'
// ];

// console.log(months[month])
// console.log(days[day])


// let date = new Date(2025, 10, 5); // установим 5 ноября 2025 года
// let day = date.getDay();
// let days = ['вс', 'пн', 'вт', 'ср', 'чт', 'пт', 'сб'];

// console.log(days[day]);
// let date = new Date(2025, 0, 1, 23, 59, 59);
// console.log(date.getTime());


// let now = new Date(); // 2023, 1, 9, 21, 5, 23
// let date = new Date(2015, 4, 25, 12, 59, 59);

// let diff = now - date; // вычитаем два объекта с датами друг от друга
// let days = Math.floor(diff / (1000 * 3600 * 24))
// let month = Math.floor(days / 30)
// let years = Math.floor(month / 12)
// console.log(years); // увидим разницу в миллисекундах\

// let date = new Date(2018, 1, 31);
// console.log(date); // какая дата будет?


// let date = new Date(2020, 3, 0)
// console.log(date.getDate())

// Оформите этот способ решения проблемы в виде функции, которая параметрами будет принимать месяц и год и 
// возвращать номер последнего дня этого месяца.

// function getLastDayOfMonth(month, year) {
//     let date = new Date(year, month + 1, 0)
//     return date.getDate()

// }

// let lastDay = getLastDayOfMonth(0, 2022)
// console.log(lastDay)

// Определите, какой день недели будет в последнем дне пятого месяца 2025 года.



// function getLastDayOfMonth(month, year) {
//     let date = new Date(year, month + 1, 0)
//     let days = ['Вс', 'Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб']
//     let day = date.getDay()
//     return days[day]

// }

// let lastDay = getLastDayOfMonth(4, 2025)
// console.log(lastDay)

// Сделайте функцию isLeap, которая параметром будет принимать год и возвращать true, если этого год високосный, и false - если нет.

// let date = new Date(2020, 2, 0);
// console.log(date.getDate())

// function isLeap(year) {
//     let date = new Date(year, 1, 0 + 1)
//     if (date.getDate() == 29) {
//         // console.log('Високосный')
//         return true
//     } else {
//         // console.log('Обычный')
//         return false
//     }
// }


// console.log(isLeap(2022))


// Сделайте функцию checkDate, которая будет выполнять описанную проверку. Пусть функция возвращает true, если дата корректна и false, если нет. 
// Пример работы этой функции для 31 января и 32 января:

// function checkDate(year, month, day) {
//     let date = new Date(year, month, day)
//     if (date.getFullYear() == year && date.getMonth() == month && date.getDate() == day) {

//         return true
//     } else {

//         return false
//     }
// }

// console.log(checkDate(2025, 0, 31))
// console.log(checkDate(2025, 0, 32))

// let now = new Date(); // получаем текущий момент
// let date = new Date(now.getFullYear(), 11, 31); // получаем нашу дату
// console.log(date.getDay());


// let now = new Date();
// let date = new Date(now.getFullYear(), now.getMonth(), 25 + 1);

// console.log(date)

// Определите, какой день недели будет 1 числа текущего месяца.

// let now = new Date();
// let date = new Date(now.getFullYear(), now.getMonth(), now.getDay(1 + 1));

// console.log(date)

// const getBlock = document.querySelector('#block p')

// console.log(getBlock)

// const getBlock = document.querySelector('.block p')

// console.log(getBlock)

// const getElemBlock = document.querySelector('.www')

// console.log(getElemBlock)


// let button = document.querySelector('#button');

// button.addEventListener('click', function() {
//     console.log('!!!');
// });

// let buttonFirst = document.querySelector('#button1')
// let buttonSec = document.querySelector('#button2')
// let buttonThre = document.querySelector('#button3')

// buttonFirst.addEventListener('click', function() {
//     alert('1')
// })
// buttonSec.addEventListener('click', function() {
//     alert('2')
// })
// buttonThre.addEventListener('click', function() {
//     alert('3')
// })

// const button = document.querySelector('#button1')
// button.addEventListener('click', func1);

// const buttonSec = document.querySelector('#button2')
// buttonSec.addEventListener('click', func2);

// function func1() {
//     console.log(1);
// }

// function func2() {
//     console.log(2);
// }

// const elem1 = document.querySelector('#elem1')
// const elem2 = document.querySelector('#elem2')
// const elem3 = document.querySelector('#elem3')
// const elem4 = document.querySelector('#elem4')
// const elem5 = document.querySelector('#elem5')


// elem1.addEventListener('click', func())
// elem2.addEventListener('click', func())

// elem3.addEventListener('click', func())
// elem4.addEventListener('click', func())

// elem5.addEventListener('click', func())

// function func() {
//     console.log('message');
// }

// const elem = document.querySelector('#elem')

// elem.addEventListener('click', func1)
// elem.addEventListener('click', func2)
// elem.addEventListener('click', func3)

// function func1() {
//     console.log('1');
// }

// function func2() {
//     console.log('2');
// }

// function func3() {
//     console.log('3');
// }


// const button = document.querySelector('#button1')

// button.addEventListener('mouseover', function() {
//     console.log('1');
// });

// button.addEventListener('mouseout', function() {
//     console.log('2');
// });


// let elem = document.querySelector('#elem')

// console.log(elem.textContent)

// elem.textContent = '!!!'

// Дан абзац и кнопка. По клику на кнопку прочитайте текст абзаца и выведите его в консоль.

// let elem = document.querySelector('#elem')
// let clickButton = document.querySelector('#elemClick')
// let elemText = elem.textContent;


// clickButton.addEventListener('click', function() {
//     console.log(elemText)
// })

// Дан абзац и кнопка. По клику на кнопку запишите в абзац новый текст.

// let elem = document.querySelector('#elem')
// let clickButton = document.querySelector('#elemClick')
// let elemText = elem.textContent

// clickButton.addEventListener('click', function() {
//     elem.textContent = 'text2'
//     console.log(elem.textContent)
// })


// Даны два абзаца, содержащие своим текстом какие-то числа, и кнопка. По нажатию на кнопку выведите на экран сумму хранящихся чисел.


let elemSum = document.querySelector('#elemSum')
let elem1 = document.querySelector('#elem1')
let elem2 = document.querySelector('#elem2')
let clickButton = document.querySelector('#elemClick')


let elemTextF = Number(elem1.textContent)
let elemTextS = Number(elem2.textContent)

clickButton.addEventListener('click', function() {
    let elemSumAll = elemTextF + elemTextS
    let elemSumNum = Number(elemSum.textContent)
    elemSum.textContent = elemSumAll + elemSumNum
})




// Дан абзац и кнопка.По клику на кнопку прочитайте HTML код абзаца и выведите его в консоль.
let elem = document.querySelector('#elem');
let elemClick = document.querySelector('#buttonClick')


elemClick.addEventListener('click', function() {
    elem.innerHTML = '<i>text</i>'
})


// Дан абзац и кнопка. По клику на кнопку запишите в абзац новый текст так, чтобы он был жирным.

// let elemInput = document.querySelector('#elemInput');

// let elemClickInput = document.querySelector('#buttonClickInput')

// elemClickInput.addEventListener('click', function() {
//     alert(elemInput.type)
// })

// Дана также кнопка. По нажатию на кнопку запишите в атрибут type значение submit.

// let elemInput = document.querySelector('#elemInput');

// let elemClickInput = document.querySelector('#buttonClickInput')

// elemClickInput.addEventListener('click', function() {
//     elemInput.type = 'submit'
// })

// Пусть у вас есть ссылка в виде тега a, кнопка и абзац. По нажатию на кнопку выведите в абзац содержимое атрибута href ссылки.



// let hrefA = document.querySelector('#hrefA')
// let elemHrefP = document.querySelector('#elemHrefP')
// let buttonHref = document.querySelector('#buttonHref')



// buttonHref.addEventListener('click', function() {
//     elemHrefP.textContent = hrefA.href
// })



let elems = document.querySelector('#elemsd');

// console.log(elems.value);

elems.value = 'new text';

// console.log(elems.value);


// Дан инпут и кнопка. По нажатию на кнопку запишите в инпут какой-нибудь текст.

let elemss = document.querySelector('#elemssd');
let elemssButton = document.querySelector('#elems_button')

elemssButton.addEventListener('click', function() {
    console.log(elemss.value)
})

// Дан инпут, абзац и кнопка. По нажатию на кнопку запишите в абзац текст из инпута.

let elementP = document.querySelector('#element_p')
let elementInput = document.querySelector('#element_input')
let elementButton = document.querySelector('#element_button')

elementButton.addEventListener('click', function() {
    elementP.textContent = elementInput.value
})


// Даны два инпута и кнопка. В первый инпут пользователем вводится число. По нажатию на кнопку запишите во второй инпут квадрат введенного числа.

let lnumber = document.querySelector('#lnumber')
let fnumber = document.querySelector('#fnumber')
let buttonQuad = document.querySelector('#button_quad')

// console.log(fnumber.value)

buttonQuad.addEventListener('click', function() {

    lnumber.value = fnumber.value * fnumber.value
})

// Даны два инпута и кнопка. По нажатию на кнопку запишите в первый инпут значение второго инпута, а во второй инпут - значение первого. 
// Ваш код должен работать универсально, для любых значений инпутов.

let firstform = document.querySelector('#first_form')
let lastform = document.querySelector('#second_form')
let buttonQuadForm = document.querySelector('#button_quad_form')
let firstFormInput = firstform.value
let lastFormInput = lastform.value

// console.log(firstFormInput = 'sadad')

buttonQuadForm.addEventListener('click', function() {
    let firstFormInput = firstform.value
    let lastFormInput = lastform.value
    firstform.value = lastFormInput
    lastform.value = firstFormInput
})


let elemFocus = document.querySelector('#elem_focus');

elemFocus.addEventListener('focus', function() {
    elemFocus.value = 1
});
elemFocus.addEventListener('blur', function() {
    elemFocus.value = 2
});

// Дан инпут. Пусть в него вводится число. По потери фокуса выведите на экран квадрат этого числа.

let elemFocusQuad = document.querySelector('#elem_focus_quad')

elemFocusQuad.addEventListener('blur', function() {
    elemFocusQuad.value = elemFocusQuad.value * elemFocusQuad.value
})


// Дан инпут, в котором изначально есть какой-то текст. По получению фокуса инпутом очистите содержимое этого инпута.

let elemFocusClear = document.querySelector('#elem_focus_clear')

elemFocusClear.addEventListener('focus', function() {
    elemFocusClear.value = ""
})

elemFocusClear.addEventListener('blur', function() {
    elemFocusClear.value = "228"
})

// Исключения при работе с атрибутами в JavaScript

let elemIsc = document.querySelector('#elem_isc')
let buttonIsc = document.querySelector('#button_isc')
    // console.log(elemIsc.textContent)
    // console.log(buttonIsc.className)

buttonIsc.addEventListener('click', function() {
    // elemIsc.textContent = elemIsc.className
    elemIsc.className = 'classnie'
})

let elemArray = document.querySelector('#elem_array')
let elemArrayBt = document.querySelector('#elem_array__button')
let arr = []

// elemArrayBt.addEventListener('click', function() {
//     let classes = elemArray.classList
//     console.log(classes)
// })

// let image = document.querySelector('#image');
// console.log(image.src);

// console.log(document.querySelector('#image').src)


//  Дан инпут. По получению фокуса этим инпутом запишите в него число 1, а по потери фокуса - число 2. Для обращения у инпуту внутри функции-обработчика используйте объект this.


let elemThis = document.querySelector('#elem_this')


elemThis.addEventListener('focus', function() {
    this.value = '1'
})
elemThis.addEventListener('blur', function() {
    this.value = '2'
})

let elemNum = document.querySelector('#elem_num')
let elemNumBt = document.querySelector('#elem_num_button')

elemNum.value = 1

elemNumBt.addEventListener('click', function() {
    let elemNumToNum = Number(elemNum.value)
    elemNum.value = elemNumToNum + 1
})

// Даны абзацы и кнопка. По нажатию на кнопку найдите все абзацы, переберите из циклом и установите текст каждого абзаца в значение 'text'.

let textWww = document.querySelectorAll('.www')
let wwwBt = document.querySelector('#www_text')

// wwwBt.addEventListener('click', function() {
//     for (let elem of textWww) {
//         elem.textContent = 'text'
//     }
// })
// Даны абзацы с текстом и кнопка. По нажатию на кнопку запишите в конец текста каждого абзаца его порядковый номер.
wwwBt.addEventListener('click', function() {
    for (let i = 0; i < textWww.length; i++) {
        textWww[i].textContent += " " + (i + 1)
    }
})


// Даны инпуты с числами, абзац и кнопка. По нажатию на кнопку найдите сумму чисел из инпутов и запишите эту сумму в текст абзаца.

let inputSum = document.querySelectorAll('.number_input')
let buttonInputSum = document.querySelector('#sum_input_num')
let inputSumValue = document.querySelector('#sum_input')



buttonInputSum.addEventListener('click', function() {
    let sum = 0
    let emptyInput = true
    for (let i = 0; i < inputSum.length; i++) {
        if (inputSum[i].value.trim() !== "") {
            sum += parseInt(inputSum[i].value)
            emptyInput = false
        }
    }
    if (emptyInput) {
        inputSumValue.textContent = 'НЕТ ЧИСЕЛ'
    } else {
        inputSumValue.textContent = 'Сумма чисел  :' + sum
    }
})


// Добавление обработчиков в цикле в JavaScript

let arrSes = document.querySelectorAll('#arr_ses')

for (let elem of arrSes) {
    elem.addEventListener('blur', func)
}

function func() {
    this.value = Number(this.value) + 1;
}


// Даны абзацы с числами. Сделайте так, чтобы по клику на любой абзац его число в нем возводилось в квадрат.


let arrQuad = document.querySelectorAll('#arr_quad')



for (let elem of arrQuad) {
    elem.addEventListener('focus', func1)
}

function func1() {
    this.value = Number(this.value) * Number(this.value)
}

// Дана ссылка и кпнока. По нажатию на кнопку добавьте в конец текста ссылки содержимое ее атрибута href в
// круглых скобках. Сделайте так, чтобы это добавление происходило лишь по первому нажатию.

let link = document.querySelector('#link')
let buttonLink = document.querySelector('#button_a_href')

buttonLink.addEventListener('click', func13)


function func13() {
    link.textContent += " (" + link.href + ")"
    this.removeEventListener('click', func13)
}


// Дана кнопка, значением которой служит число 1. Сделайте так, чтобы по клику на эту кнопку ее значение каждый раз увеличивалось на единицу. 
// После того, как значение кнопки достигнет 10 - отвяжите обработчик события, чтобы кнопка больше не реагировала на нажатие.

let clickPluseInput = document.querySelector('#click_pluse_input')
let clickPluseButton = document.querySelector('#click_pluse_button')

clickPluseButton.addEventListener('click', clickPluse)

function clickPluse() {
    clickPluseInput.value = Number(clickPluseInput.value) + 1
    if (clickPluseInput.value == 10) {
        clickPluseButton.removeEventListener('click', clickPluse)
    }
}


// Метод getAttribute


let getAtribut = document.querySelector('#getAtribut')
let value = getAtribut.getAttribute('class')

console.log(value)